package com.example.italianfoodukraine.list_of_food

import com.example.italianfoodukraine.R
import com.example.italianfoodukraine.model.RecipeModel

object BigListOfFood {

    val recipes = listOf(


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 2,
            categoryOfFood = "Антипасти",
            dishTitle = "Буррата з тушкованими помідорами",
            imageResId = R.drawable.burrata_with_roasted_tomatoes_2,
            description =
            "Буррата з тушкованими помідорами - вишукана італійська закуска. Вершковий сир буррата, відомий своєю ніжною текстурою, подається разом з ароматними тушкованими помідорами, приготованими на повільному вогні. Вершкова насиченість буррати ідеально доповнює пікантну солодкість томатів, створюючи гармонійне та вишукане смакове поєднання.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "700 г помідорів (наприклад, яловичих сердець), розрізаних навпіл\n" +
                        "2 столові ложки оливкової олії\n" +
                        "½ чайної ложки солі\n" +
                        "2 столові ложки цукру\n" +
                        "2 столові ложки води\n" +
                        "2 столові ложки насіння кропу\n" +
                        "300 г бурати\n" +
                        "2 столові ложки червоного винного оцту\n" +
                        "2 столові ложки оливкової олії\n" +
                        "2 зубчики часнику\n" +
                        "½ чайної ложки солі, трохи перцю",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Викласти помідори на деко, застелене папером для випічки, збризнути олією та посолити.\n" +
                        "Запікати близько 20 хвилин у верхній частині духовки, розігрітої до 220°C. Вийняти і дати охолонути.\n" +
                        "У невеликій каструлі довести воду з цукром до кипіння, не помішуючи. Зменшити вогонь і варити 3 хвилини, поки на поверхні не з'являться бульбашки. Додати насіння фенхелю і варити, помішуючи, поки вода не випарується, а насіння фенхелю не стане сухим і білим. Зняти сковороду з вогню і продовжувати коротко помішувати. Викласти насіння фенхелю на аркуш паперу для випічки і дати охолонути.\n" +
                        "Злити буррату, зібрати 3 столові ложки рідини і перелити в блендер. Змішати і заправити оцтом, олією, часником і 2 половинками тушкованих помідорів (близько 150 г).\n" +
                        "Виливаємо заправку на тарілку. Зверху викласти буррату та помідори. Посипати насінням фенхелю.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 3,
            categoryOfFood = "Антипасти",
            dishTitle = "Буррата з лимоном і базиліком",
            imageResId = R.drawable.burrata_with_lemons,
            description =
            "Буррата з лимоном і базиліком - чудова італійська закуска. У ній вершковий сир буррата поєднується з пікантною яскравістю свіжого лимона та ароматною свіжістю листя базиліка. Таке поєднання створює гармонійний контраст смаків і текстур, роблячи цю страву освіжаючою та поблажливою.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 зубчик часнику\n" +
                        "300 г буррата\n" +
                        "2 столові ложки білого бальзамічного оцту\n" +
                        "3 столові ложки лимонної оливкової олії\n" +
                        "1/4 чайної ложки солі трохи перцю\n" +
                        "2 очищені лимони, нарізані скибочками\n" +
                        "½ пучка листя базиліка\n" +
                        "трохи флер де сел"
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Нарізати хліб: Викласти скибочки хліба на тарілку.\n" +
                        "2. Підсмажити: Підсмажте скибочки хліба приблизно 10 хвилин у верхній частині духовки, розігрітої до 220°C. Вийняти і дати охолонути. Натерти скибочки хліба часником.\n" +
                        "3. Буррата: нарізати буррату і покласти в салатник. Змішати оцет і олію, заправити і полити буррату. Прикрасити лимоном і базиліком, посипати флердоранжем. Подавати буррату з підсмаженим хлібом.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 4,
            categoryOfFood = "Антипасти",
            dishTitle = "Брускетта",
            imageResId = R.drawable.bruschetta_1,
            description =
            "Брускетта - класична італійська закуска до пасти. Це ароматна суміш підсмаженого хліба, свіжих помідорів, базиліка, часнику та оливкової олії. Для цієї страви немає особливих дієтичних обмежень, що робить її універсальним вибором. Кожна порція зазвичай містить близько 70-100 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "4 великі стиглі помідори\n" +
                        "1/4 склянки свіжого листя базиліка\n" +
                        "2 зубчики часнику\n" +
                        "1/4 склянки оливкової олії першого віджиму\n" +
                        "Сіль і перець за смаком\n" +
                        "1 багет італійського хліба",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Помідори нарізати кубиками, базилік подрібнити, часник подрібнити.\n" +
                        "2. Змішуємо помідори, базилік та часник у мисці. Додати оливкову олію, сіль та перець. Добре перемішати.\n" +
                        "3. Нарізати хліб скибочками завтовшки 1 дюйм і підсмажити до золотистої скоринки.\n" +
                        "4. Натріть підсмажений хліб зубчиком часнику для додаткового аромату.\n" +
                        "5. Ложкою викладіть томатну суміш на підсмажені скибочки хліба.\n" +
                        "6. Збризніть ще трохи оливковою олією та прикрасьте додатково базиліком.\n" +
                        "7. Подавайте негайно та насолоджуйтеся смачною брускеттою!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 5,
            categoryOfFood = "Антипасти",
            dishTitle = "Салат Капрезе",
            imageResId = R.drawable.caprese_salad_5,
            description =
            "Салат капрезе - чудова італійська страва, яка не потребує приготування, що робить її ідеальною літньою закускою. Він не має особливих дієтичних обмежень і є різновидом салату. В середньому він містить близько 150 калорій на порцію.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "4 стиглі помідори\n" +
                        "200 г свіжого сиру моцарела\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія Extra Virgin\n" +
                        "Бальзамічний оцет (за бажанням)\n" +
                        "Сіль і перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Нарізати помідори та моцарелу кружальцями товщиною 1/4 дюйма.\n" +
                        "2. Викласти на сервірувальне блюдо, чергуючи скибочки помідорів і моцарели.\n" +
                        "3. Між помідорами та моцарелою покласти листя свіжого базиліка.\n" +
                        "4. Збризніть оливковою олією (і бальзамічним оцтом за бажанням).\n" +
                        "5. Посолити та поперчити.\n" +
                        "6. Прикрасити свіжим базиліком.\n" +
                        "7. Подавайте негайно і насолоджуйтеся цим простим, освіжаючим салатом Капрезе!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 6,
            categoryOfFood = "Антипасти",
            dishTitle = "Прошутто з динею",
            imageResId = R.drawable.prosciutto_and_melon_3,
            description =
            "Прошутто з динею - класична італійська закуска, яка поєднує солодкість стиглої дині з пікантним, солоним смаком прошутто. Особливих дієтичних обмежень для цієї страви немає. Це холодна закуска, і кожна порція містить приблизно 60-80 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "1 стигла канталупа або диня медової роси\n" +
                        "8 скибочок прошутто",
            ),
            instructions = listOf(
                "Процес приготування: \n" ,
                        "1. Розрізаємо диню навпіл, видаляємо насіння та нарізаємо тонкими часточками або кубиками. \n" +
                        "2. Акуратно обертаємо кожну скибочку дині скибочкою прошутто. \n" +
                        "3. Викласти диню, загорнуту в прошутто, на тарілку. \n" +
                        "4. Можна подавати так, як є, або прикрасити свіжими листочками м'яти для додаткової свіжості. \n" +
                        "5. Насолоджуйтесь цією чудовою закускою, яка не потребує приготування, що ідеально балансує солодкий та солоний смаки.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 7,
            categoryOfFood = "Антипасти",
            dishTitle = "Смажені кальмари",
            imageResId = R.drawable.fried_calamari_7_small,
            description =
            "Смажені кальмари - це класична італійська страва, відома своїми хрусткими, ніжними та ароматними смаженими кальмарами. Зазвичай її подають як закуску або гарнір. Не має особливих дієтичних обмежень, що робить її придатною для більшості людей. Кожна порція смажених кальмарів містить приблизно 200-250 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "1 фунт (450 г) свіжих кальмарів (очищених і нарізаних кільцями)\n" +
                        "1 склянка борошна грубого помелу\n" +
                        "1/2 склянки кукурудзяного крохмалю\n" +
                        "1 чайна ложка солі\n" +
                        "1/2 чайної ложки чорного перцю\n" +
                        "1/2 чайної ложки паприки\n" +
                        "Рослинна олія (для смаження)\n" +
                        "Часточки лимона (для прикраси)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Змішати в мисці борошно, кукурудзяний крохмаль, сіль, перець та паприку.\n" +
                        "2. Нагрійте рослинну олію у фритюрниці або великій каструлі до 350°F (180°C).\n" +
                        "3. Обваляйте кільця кальмарів у борошняній суміші, струшуючи надлишки.\n" +
                        "4. Обережно опустити кальмари в паніровці в гарячу олію і смажити до золотистої скоринки (приблизно 23 хвилини).\n" +
                        "5. За допомогою шумівки виймаємо кальмари та викладаємо на паперові рушники, щоб стекла зайва олія.\n" +
                        "6. Подавайте гарячими з часточками лимона і насолоджуйтеся хрусткими смаженими кальмарами!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 8,
            categoryOfFood = "Антипасти",
            dishTitle = "Аранчіні (фаршировані рисові кульки)",
            imageResId = R.drawable.aranchinne_stuffed_rice_balls_8_good_pic,
            description =
            "Аранчіні - це смачні італійські рисові кульки з начинкою. Не мають особливих дієтичних обмежень, але зазвичай не підходять для безглютенової дієти через використання панірувальних сухарів. Вони є різновидом закуски або перекусу. Кожна кулька аранчіні містить близько 150-200 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 12 кульок аранчіні):\n" ,
                        "2 склянки рису Арборіо\n" +
                        "4 склянки курячого або овочевого бульйону\n" +
                        "1/2 склянки тертого сиру пармезан\n" +
                        "2 великі яйця\n" +
                        "1/2 склянки сиру моцарела (кубиками)\n" +
                        "1/2 склянки вареного яловичого фаршу або ковбаси (за бажанням)\n" +
                        "1/4 склянки свіжої петрушки (подрібненої)\n" +
                        "Сіль і перець за смаком\n" +
                        "1 склянка панірувальних сухарів\n" +
                        "Рослинна олія для смаження",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Відваріть рис Арборіо в бульйоні до готовності, потім дайте йому охолонути.\n" +
                        "Змішайте пармезан, яйця, петрушку, сіль та перець.\n" +
                        "Візьміть жменю рисової суміші, розрівняйте її, додайте кубик моцарели і ложку м'яса (якщо використовуєте), потім сформуйте кульку.\n" +
                        "Обваляти кульку в панірувальних сухарях.\n" +
                        "Розігріти олію до 350°F (175°C) і обсмажити аранчіні до золотистого кольору.\n" +
                        "Викладіть на паперові рушники, подавайте гарячими і насолоджуйтеся смачними аранчіні!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 9,
            categoryOfFood = "Антипасти",
            dishTitle = "Моцарела в кареті",
            imageResId = R.drawable.mozzarella_carrozza_6,
            description =
            "Моцарела в кареті - вишукана італійська страва, що складається зі смаженого сиру моцарела, прокладеного між шматочками хліба. Вона не підходить для тих, хто має обмеження на глютен або лактозу через використання хліба та сиру. Кожна порція містить близько 300-350 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "8 скибочок білого хліба\n" +
                        "8 скибочок свіжого сиру моцарела\n" +
                        "2 великих яйця\n" +
                        "1/2 склянки молока\n" +
                        "Сіль і перець за смаком\n" +
                        "Борошно (для панірування)\n" +
                        "Оливкова олія (для смаження)\n" +
                        "Свіже листя базиліка (за бажанням)\n" +
                        "Соус Маринара (для вмочування, за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Покладіть шматочки моцарели між двома скибочками хліба, щоб сформувати бутерброди.\n" +
                        "У мисці збийте яйця, молоко, сіль та перець.\n" +
                        "Обваляти бутерброди в борошні, потім занурити в яєчну суміш.\n" +
                        "Нагріваємо оливкову олію на сковороді на середньому вогні.\n" +
                        "Обсмажити сендвічі до золотистої скоринки з обох боків.\n" +
                        "Виймаємо, висипаємо на паперові рушники та прикрашаємо базиліком.\n" +
                        "Подавати гарячими, за бажанням, з соусом маринара для вмочування. Насолоджуйтесь хрусткою моцарелою в карроцці!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 10,
            categoryOfFood = "Антипасти",
            dishTitle = "Панцанелла",
            imageResId = R.drawable.panzanella_7,
            description =
            "Панцанелла - класичний італійський хлібний салат, який ідеально підходить для літа. Він не має особливих дієтичних обмежень. До складу цього салату зазвичай входить черствий хліб, помідори, цибуля, базилік і простий вінегрет. Це освіжаюча страва, яка містить близько 150-250 калорій на порцію, залежно від порцій та додаткових інгредієнтів.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "4 склянки черствого італійського хліба, розрізаного на шматочки\n" +
                        "4 великі стиглі помідори, нарізані шматочками\n" +
                        "1 червона цибулина, тонко нарізана\n" +
                        "1/2 склянки свіжого листя базиліка, порваного\n" +
                        "1/4 склянки оливкової олії першого віджиму\n" +
                        "3 столові ложки червоного винного оцту\n" +
                        "Сіль і чорний перець за смаком\n" +
                        "За бажанням: огірок, болгарський перець, оливки або каперси",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій мисці змішайте хліб, помідори, цибулю та базилік.\n" +
                        "У невеликій мисці збийте оливкову олію, червоний винний оцет, сіль і перець.\n" +
                        "Полити заправкою салат і перемішати, щоб перемішати.\n" +
                        "Дати салату настоятися близько 30 хвилин, щоб смаки злилися воєдино.\n" +
                        "Якщо потрібно, додайте ще заправки та подавайте до столу. Насолоджуйтесь освіжаючою Панцанеллою!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 13,
            categoryOfFood = "Антипасти",
            dishTitle = "Вітелло Тоннато (телятина з тунцем під соусом)",
            imageResId = R.drawable.vitello_tonnato_13_new,
            description =
            "Вітелло Тоннато - це італійська холодна страва, що складається з тонко нарізаної телятини, яку подають з вершковим соусом з тунця та анчоусів. Суворих дієтичних обмежень немає, але вона не підходить для вегетаріанців. Це різновид антипасто з приблизно 200-250 калоріями на порцію.",
            ingredients = listOf(
                "Інгредієнти (на 6 порцій):\n" ,
                        "500 г тонко нарізаної телятини\n" +
                        "150 г консервованого тунця в олії, відцідженого\n" +
                        "45 філе анчоусів\n" +
                        "2 яєчних жовтки\n" +
                        "2 ст.л. каперсів\n" +
                        "2 ст.л. лимонного соку\n" +
                        "150мл майонезу\n" +
                        "Сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Відціджений тунець, анчоуси, яєчні жовтки, каперси та лимонний сік змішати в кухонному комбайні до однорідної маси.\n" +
                        "Поступово додайте майонез і збивайте, поки соус не стане кремоподібним.\n" +
                        "Посолити та поперчити за смаком.\n" +
                        "Викласти шматочки телятини на сервірувальну тарілку.\n" +
                        "Вилити соус з тунця на шматочки телятини, повністю покриваючи їх.\n" +
                        "Перед подачею на стіл поставити в холодильник на кілька годин, щоб смаки злилися воєдино.\n" +
                        "Подавайте охолодженим і за бажанням прикрасьте додатково каперсами та скибочками лимона.\n" +
                        "Насолоджуйтесь цією класичною італійською стравою як закускою або легкою основною стравою.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 17,
            categoryOfFood = "Паста",
            dishTitle = "Лазанья",
            imageResId = R.drawable.lasagna_13,
            description =
            "Лазанья - улюблена італійська страва, відома своїми шарами пасти, густим соусом і плавленим сиром.  Лазанья зазвичай містить м'ясо, молочні продукти (сир і соус бешамель) і макарони на основі пшениці, що робить її непридатною для вегетаріанців і людей з непереносимістю лактози або глютену. Це багатошарова страва з макаронних виробів, що складається з листів лазаньї, м'ясного соусу, соусу рікотта або бешамель, моцарели та сиру пармезан.",
            ingredients = listOf(
                "Інгредієнти (кількість залежить від рецепту):\n" ,
                        "Локшина для лазаньї\n" +
                        "М'ясний фарш (зазвичай яловичина, свинина або їх поєднання)\n" +
                        "Томатний соус\n" +
                        "Соус рікотта або бешамель\n" +
                        "Сир моцарела\n" +
                        "Сир пармезан\n" +
                        "Цибуля, часник і зелень (для аромату)\n" +
                        "Оливкова олія\n" +
                        "Сіль та перець",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Відварити локшину для лазаньї згідно з інструкцією на упаковці.\n" +
                        "Підрум'янити м'ясний фарш з цибулею та часником, додати томатний соус і приправити.\n" +
                        "У форму для запікання викласти шарами локшину, м'ясний соус, рікотту або бешамель та сири.\n" +
                        "Повторювати шари, закінчуючи сиром зверху.\n" +
                        "Випікати до утворення пухирців і золотистого кольору.\n" +
                        "Перед подачею дати відпочити.\n" +
                        "Для наочності ви можете переглянути зображення цієї страви на вказаних сайтах з рецептами.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 19,
            categoryOfFood = "Паста",
            dishTitle = "Паста з морепродуктами Scialatielli allo Scoglio",
            imageResId = R.drawable.scialatielli_allo_scoglio_19,
            description =
            "Паста з морепродуктами, відома як Scialatielli allo Scoglio, - це вишукана італійська прибережна страва, яка демонструє щедрість моря. Ця ароматна паста зазвичай містить суміш свіжих морепродуктів, таких як мідії, молюски, креветки, а іноді й кальмари, приготованих до досконалості. Морепродукти поєднуються з ароматним томатним соусом на основі часнику, пластівців чилі та свіжої зелені, наприклад, петрушки. Цей яскравий соус огортає пасту аль денте, створюючи гармонійне поєднання текстур і смаків. Страва пропонує чудовий контраст між солодкістю морепродуктів і гостротою томатного соусу, що робить її улюбленою в італійській кухні. Scialatielli allo Scoglio відображає суть життя на узбережжі, приносячи смак Середземномор'я на вашу тарілку.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "300 г білого борошна\n" +
                        "½ чайної ложки солі\n" +
                        "1 склянка молока\n" +
                        "1½ столові ложки оливкової олії \n" +
                        "1 яйце\n" +
                        "50 г дрібно натертого сиру пекоріно\n" +
                        "½ пучка подрібненого базиліка\n" +
                        "трохи білого борошна\n" +
                        "2 столові ложки оливкової олії \n" +
                        "2 зубчики часнику, дрібно нарізані\n" +
                        "1 червоний перець, нарізаний\n" +
                        "300 г помідорів черрі, розрізаних навпіл\n" +
                        "1 склянка білого вина\n" +
                        "3/4 чайної ложки солі\n" +
                        "400 г заморожених морепродуктів, розморожених \n" +
                        "1 крупно нарізаний пучок петрушки\n" +
                        "½ пучка плоскої петрушки, крупно нарізаної",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Приготувати тісто для локшини: змішати в мисці борошно і сіль. Додайте молоко, олію та яйце, перемішайте і вимішуйте близько 10 хвилин, щоб вийшло м'яке і гладке тісто. Додати сир і базилік, вимісити і сформувати кулю. Накрити тісто мискою з гарячою водою і притрусити петрушкою. Залиште при кімнатній температурі приблизно на 30 хвилин.\n" +
                        "2. Сціалатієлліс: розрізати тісто на чотири частини. На добре присипаній борошном робочій поверхні розкачати їх до товщини приблизно 2 мм (приблизно 12×60 см), регулярно прибираючи тісто з робочої поверхні. регулярно розкачувати тісто. Шматки тіста вільно розкачати вздовж, нарізати на смужки шириною приблизно 4 мм, викласти на кухонний рушник. \n" +
                        "3. Готуємо соус: Нагріти олію у великій каструлі. Недовго обсмажити часник і перець чилі. часник і перець чилі. Додати помідори і вино, тушкувати близько 5 хвилин, посолити. Додати морепродукти, накрити кришкою і тушкувати 2 хвилини. Додати петрушку і перемішати. \n" +
                        "4. Паста: опустити чіалятеллі в киплячу підсолену воду і варити аль денте протягом 3 хвилин. Вийняти шумівкою, обсушити, додати до соусу та перемішати. Розкласти макарони та посипати сиром.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 20,
            categoryOfFood = "Паста",
            dishTitle = "Ньоккі алла Соррентіна",
            imageResId = R.drawable.gnocchi_alla_sorrentina_20,
            description =
            "Ньоккі алла Соррентина - улюблена італійська страва з макаронів, яка походить з мальовничого півострова Сорренто на півдні Італії. Ця страва складається з м'яких і пухких картопляних ньоккі, зазвичай домашнього приготування, хоча можна використовувати і магазинні варіанти. Ньоккі тушкуються в соковитому томатному соусі, приготованому зі стиглих томатів сорту Сан-Марцано, часнику, свіжого листя базиліка та сиру моцарела. Готові ньоккі промащують цим ароматним соусом і щедро посипають свіжою моцарелою, а потім запікають до утворення пухирців і золотистого відтінку.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "700 г картоплі\n" +
                        "175 г білого борошна\n" +
                        "50 г тертого пармезану\n" +
                        "1 свіже збите яйце\n" +
                        "1½ чайної ложки солі\n" +
                        "1 столова ложка оливкової олії\n" +
                        "1 дрібно нарізана цибулина\n" +
                        "1 банка помідорів черрі (приблизно 400 г)\n" +
                        "250 г помідорів черрі\n" +
                        "1/2 чайної ложки цукру\n" +
                        "2 чайні ложки солі\n" +
                        "трохи перцю\n" +
                        "150 г моцарели, нарізаної на шматочки \n" +
                        "½ пучка подрібненого базиліка\n" +
                        "50 г тертого пармезану",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Для суміші для ньоккі: Варимо картоплю в окропі близько 20 хвилин. Ще гарячою почистіть картоплю та розімніть її в мисці, дайте їй охолонути. Додайте борошно, пармезан, яйце, сіль і перемішайте. Маса повинна бути вологою, не прилипати до рук. За потреби додати ще трохи борошна. \n" +
                        "2. Формуємо: присипаємо масу невеликою кількістю борошна і формуємо 4 рулетики по 2 см кожен. Розріжте їх на шматочки по 2 см і обмотайте великим пальцем навколо зубців виделки, щоб зробити борозенки. Викласти ньоккі на присипану борошном тканину.\n" +
                        "3. Томатний соус: розігріти олію в каструлі та обсмажити цибулю. \n" +
                        "Додати помідори черрі та цукор, довести до кипіння. Накрити кришкою і тушкувати близько 10 хвилин, приправити.\n" +
                        "4. Ньоккі: Відварити ньокки кілька разів у киплячій підсоленій воді протягом 4 хвилин, поки вони не спливуть на поверхню.\n" +
                        "Вийняти їх шумівкою, злити воду і додати до томатного соусу.\n" +
                        "5. Начинка: викласти ньоккі у формочки, зверху викласти моцарелу та базилік, посипати сиром пармезан.\n" +
                        "6. Приготування: готувати близько 30 хвилин у духовці, розігрітій до 200°C.",
            )
        ),


        RecipeModel(
            id = 15,
            categoryOfFood = "Паста",
            dishTitle = "Спагеті карбонара",
            imageResId = R.drawable.carbonara_new11,
            description =
            "Спагеті карбонара - класична італійська страва з макаронів. Вона не підходить для вегетаріанців, оскільки містить яйця, сир і панчетту. Страва вершкова, пікантна та насичена, з приблизно 400-450 калоріями на порцію.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n",
                "400 г спагеті\n" +
                        "150 г панчетти або гвіанче, нарізаних кубиками\n" +
                        "3 великих яйця\n" +
                        "100 г сиру Пекоріно Романо, натертого на тертці\n" +
                        "50 г пармезану, натертого на тертці\n" +
                        "2 зубчики часнику, подрібнені (за бажанням)\n" +
                        "Сіль і чорний перець за смаком\n" +
                        "Свіжа петрушка, подрібнена (для прикраси)",
            ),
            instructions = listOf(
                "Процес приготування:\n",
                "Відварити спагеті в підсоленій киплячій воді до стану аль денте. Перед тим, як злити воду, залишити приблизно 1/2 склянки води для варіння макаронів.\n" +
                        "В окремій мисці збити яйця, тертий пекоріно романо та тертий пармезан. Приправити чорним перцем.\n" +
                        "На сковороді обсмажити нарізану кубиками панчетту або гвіанче до хрусткої скоринки. За бажанням додайте подрібнений часник для додаткового аромату.\n" +
                        "Знімаємо сковороду з вогню і даємо їй трохи охолонути.\n" +
                        "З'єднайте готову пасту з панчеттою/гуанчіче та добре перемішайте.\n" +
                        "Швидко виливаємо яєчно-сирну суміш на макарони. Перемішуємо, щоб рівномірно покрити макарони. Якщо макарони здаються сухуватими, додати трохи зарезервованої води для варіння макаронів.\n" +
                        "Подавати негайно, прикрасивши свіжою петрушкою та додатковим сиром за бажанням.\n" +
                        "Насолоджуйтесь цією вершковою та вишуканою італійською класикою!"
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 16,
            categoryOfFood = "Паста",
            dishTitle = "Феттучіне Альфредо",
            imageResId = R.drawable.fetticine_alfredo_12,
            description = "Феттучіне Альфредо - класична італійська страва з макаронів, відома своїм вершковим, ніжним соусом. Традиційне  Феттучіне Альфредо не підходить для веганської або безмолочної дієти через його багатий соус на основі вершкового масла та вершків . Це вершкова страва з локшини фетучіні, вершкового масла, жирних вершків і сиру пармезан",

            ingredients = listOf(
                "Інгредієнти:\n",
                "8 унцій (близько 2 склянок) пасти фетучіні\n" +
                        "1/2 склянки несолоного вершкового масла\n" +
                        "1 склянка жирних вершків\n" +
                        "1 1/2 склянки тертого пармезану\n" +
                        "Сіль і перець за смаком\n" +
                        "Додатково: часниковий фарш, петрушка для прикраси",
            ),
            instructions = listOf(
                "Процес приготування:\n",
                "Відваріть пасту фетучіні відповідно до інструкцій на упаковці до стану аль денте, потім відцідіть воду.\n" +
                        "У великій сковороді розтопити вершкове масло на середньому вогні. За бажанням додайте подрібнений часник і коротко обсмажте для аромату.\n" +
                        "Влити жирні вершки і довести до кипіння.\n" +
                        "Зменшити вогонь і поступово всипати тертий пармезан, поки соус не стане однорідним і не загусне.\n" +
                        "Посолити та поперчити за смаком.\n" +
                        "Додаємо до соусу відварені фетучіні, перемішуємо, щоб локшина ретельно вкрилася соусом.\n" +
                        "Подавати гарячими, за бажанням прикрасивши петрушкою.\n" +
                        "Для наочності ви можете переглянути зображення цієї страви на вказаних сайтах з рецептами",
            )
        ),


        RecipeModel(
            id = 18,
            categoryOfFood = "Паста",
            dishTitle = "Равіолі",
            imageResId = R.drawable.ravioli_14,
            description =
            "Равіолі - це класична італійська страва з макаронних виробів, що складається з кишеньок з начинкою. Рецепти равіолі можуть бути найрізноманітнішими. Типові начинки включають сир, м'ясо або овочі, тому дієтичні обмеження залежать від рецепту. Равіолі - це страва з макаронного тіста, що складається з маленьких квадратиків або кружечків, фаршированих різними начинками, і зазвичай подається з соусом.",
            ingredients = listOf(
                "Інгредієнти (кількість може змінюватися):\n",
                "2 склянки борошна грубого помелу\n" +
                        "2 великих яйця\n" +
                        "1/2 чайної ложки солі\n" +
                        "1/3 склянки води\n" +
                        "Начинка: сир рікотта, сир моцарела, сир пармезан, сир проволоне\n" +
                        "Соус: томатний соус, масло, часник, базилік, сіль, перець",
            ),
            instructions = listOf(
                "Процес приготування:\n",
                "Замісити тісто для макаронів, змішавши борошно, яйця, сіль і воду. Вимісити, потім тонко розкачати.\n" +
                        "Змішати рікотту, моцарелу, пармезан та проволоне, щоб приготувати сирну начинку.\n" +
                        "Викладіть ложками начинку на лист макаронів, залишаючи між ними проміжки.\n" +
                        "Складіть макарони так, щоб покрити начинку, притисніть, щоб запечатати, і розріжте на окремі равіолі.\n" +
                        "Варити равіолі в киплячій воді, поки вони не спливуть на поверхню.\n" +
                        "Тим часом приготуйте соус, розігрівши вершкове масло, часник, базилік, сіль і перець з томатним соусом.\n" +
                        "Подавайте готові равіолі з томатним соусом.\n" +
                        "Для наочності ви можете знайти зображення страв з равіолі на різних кулінарних сайтах, наприклад, на сайті Allrecipes.",
            )
        ),


        RecipeModel(
            id = 21,
            categoryOfFood = "Паста",
            dishTitle = "Пенне з горілкою",
            imageResId = R.drawable.penne_alla_vodka_15,
            description =
            "Пенне алла горілка - це італійська страва з макаронних виробів, відома своїм вершково-томатним горілчаним соусом. Пенне алла Горілка зазвичай містить алкоголь (горілку) та молочні продукти (вершки), що робить її непридатною для людей з непереносимістю алкоголю або лактози. Це страва з макаронних виробів, що складається з пасти пенне з вершково-томатним соусом, настояним на горілці. ",
            ingredients = listOf(
                "Інгредієнти:\n",
                "2 великі червоні картоплини (близько 1 фунта)\n" +
                        "1 склянка борошна грубого помелу\n" +
                        "1 яйце (за бажанням)\n" +
                        "Сіль",
            ),
            instructions = listOf(
                "Процес приготування:\n",
                "Відварити пасту пенне до стану аль денте. Відцідити та відставити.\n" +
                        "Нагріти оливкову олію на середньому вогні в сковорідці, додати горілку і залишити на повільному вогні, щоб вона зменшилася вдвічі.\n" +
                        "Влити томатний соус і жирні вершки. Тушкувати кілька хвилин.\n" +
                        "За бажанням посолити, поперчити та додати пластівці червоного перцю.\n" +
                        "Додайте в соус відварену пасту пенне і перемішайте, щоб вона покрилася соусом.\n" +
                        "Прикрасьте свіжим базиліком і тертим пармезаном.\n" +
                        "Подавати гарячою та насолоджуватися Penne alla Vodka!\n" +
                        "Ви можете переглянути зображення цієї страви на різних кулінарних сайтах для наочного ознайомлення."
            )
        ),


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 22,
            categoryOfFood = "Паста",
            dishTitle = "Ньоккі",
            imageResId = R.drawable.niokki_gnokki_22,
            description =
            "Ньоккі - класична італійська страва, відома своїми м'якими картопляними галушками. Ньоккі, як правило, підходять для вегетаріанців, але деякі рецепти можуть містити яйця. Вони не містять глютену завдяки використанню пшеничного борошна. Ньоккі - це м'які, подушкоподібні картопляні галушки, які подають з різними соусами, найчастіше томатним або песто. В середньому порція картопляних ньоккі містить близько 130-150 калорій. Ньоккі - це чудові італійські галушки з картопляного пюре та борошна, які створюють ніжну, ситну альтернативу макаронам. Приготування ньоккі включає в себе приготування картопляного тіста, формування галушок, їх відварювання та подачу з улюбленим соусом. Рецепти варіюються, але типовий рецепт розрахований на 4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n",
                "2 великі червоні картоплини (близько 1 фунта)\n" +
                        "1 склянка борошна грубого помелу\n" +
                        "1 яйце (за бажанням)\n" +
                        "Сіль",
            ),
            instructions = listOf(
                "Процес приготування:\n",
                "Відваріть або запечіть картоплю до готовності, потім почистіть і розімніть її в пюре.\n" +
                        "Змішати борошно, яйце (якщо використовуєте) і дрібку солі, утворивши тісто.\n" +
                        "Розділіть тісто на невеликі порції, розкачайте кожну в мотузочку і наріжте на шматочки розміром з укус.\n" +
                        "Зробіть на кожній ньоккі гребінці за допомогою виделки.\n" +
                        "Відваріть у підсоленій воді, поки вони не спливуть на поверхню (приблизно 23 хвилини).\n" +
                        "Подавайте з улюбленим соусом, наприклад, томатним або песто.\n" +
                        "Ви можете знайти зображення цієї страви на різних кулінарних сайтах для візуального ознайомлення.",
            )
        ),

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 23,
            categoryOfFood = "Паста",
            dishTitle = "Паста Прімавера",
            imageResId = R.drawable.pasta_primavera_17,
            description =
            "Паста Прімавера - це італійська страва з макаронних виробів зі свіжими овочами. Ось запитувана інформація: Паста Примавера, як правило, вегетаріанська і може бути адаптована до веганських дієт, якщо не додавати сир. Вона підходить для більшості дієтичних уподобань. Це страва з макаронних виробів зі свіжими пасерованими овочами, яку зазвичай подають з фетучіні або спагеті. Типова порція Pasta Primavera містить близько 250-350 калорій. Паста примавера - це яскрава італійська страва, що оспівує весняні аромати. Вона поєднує сезонні овочі з макаронами та легким соусом, створюючи свіжу та яскраву страву. Приготування пасти примавера включає в себе варіння пасти, пасерування овочів і приготування легкого соусу. Рецепти варіюються, але типовий рецепт розрахований на 4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n",
                "8 унцій фетучіні або спагеті\n" +
                        "Асорті овочів: болгарський перець, помідори черрі, цукіні, горошок\n" +
                        "Оливкова олія\n" +
                        "Часник\n" +
                        "Сир пармезан (за бажанням)\n" +
                        "Свіжий базилік\n" +
                        "Сіль та перець",
            ),
            instructions = listOf(
                "Процес приготування:\n",
                "Відваріть макарони згідно з інструкцією на упаковці.\n" +
                        "На сковороді обсмажити часник на оливковій олії, додати овочі та готувати до готовності.\n" +
                        "Готову пасту додати до овочевої пасеровки.\n" +
                        "Прикрасьте свіжим базиліком, сиром пармезан, сіллю та перцем.\n" +
                        "Подавайте гарячою і насолоджуйтеся пастою Прімавера!\n" +
                        "Для наочності ви можете знайти зображення цієї страви на різних кулінарних сайтах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 24,
            categoryOfFood = "Паста",
            dishTitle = "Ореккетте з броколі рабе",
            imageResId = R.drawable.orecchiette_with_broccoli_rabe_18,
            description =
            "Орек'єте з броколі рабе - італійська страва, відома своєю унікальною пастою у формі вуха та смачною гірчинкою броколі рабе. Ця страва не має особливих дієтичних обмежень, але ви можете адаптувати її до своїх уподобань, включаючи вегетаріанські або веганські варіації. Орек'єте з броколі рабе - класична італійська страва з макаронних виробів. Кількість калорій може варіюватися залежно від інгредієнтів та розміру порції, але зазвичай становить близько 350-400 калорій на порцію. Ця страва складається з макаронних виробів Орек'єте, заправлених пасерованою броколі рабе, часником і пластівцями чилі, і часто включає ковбасу або сир для додаткового смаку. Вона пропонує чудовий баланс смаків і текстур. Приготування орек'єте з броколі рабе включає підготовку макаронних виробів, пасерування броколі рабе з часником і пластівцями чилі та додавання вареної ковбаси або сиру. Зазвичай рецепти розраховані на 4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "12 унцій макаронних виробів ореккієтте\n" +
                        "1 пучок брокколі рабе\n" +
                        "2 зубчики часнику\n" +
                        "Пластівці червоного перцю (за смаком)\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець\n" +
                        "Тертий сир Пекоріно Романо (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Відварити пасту ореккієтте до стану аль денте. Відцідити воду і відставити в сторону.\n" +
                        "У великій сковороді обсмажити часник і пластівці червоного перцю на оливковій олії.\n" +
                        "Додайте нарізану броколі рабе і готуйте до готовності.\n" +
                        "Готову пасту всипати до суміші з броколі рабе.\n" +
                        "Посолити та поперчити. За бажанням посипте зверху тертим сиром Пекоріно Романо.\n" +
                        "Подавайте гарячими та насолоджуйтеся ореккієтте з броколі рабе!\n" +
                        "Зображення та детальні інструкції ви можете знайти у наданих джерелах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 25,
            categoryOfFood = "Паста",
            dishTitle = "Качіо є Пепе",
            imageResId = R.drawable.cacio_e_pepe_19,
            description =
            "Качо е пепе - класична римська страва з макаронів, відома своєю простотою та сміливими смаками. По суті, це паста з сиром і чорним перцем. Ця страва, як правило, не підходить для вегетаріанців, оскільки містить сир Пекоріно Романо, виготовлений з овечого молока. Вона також не підходить для людей з непереносимістю лактози або алергією на молочні продукти. Качо е Пепе - традиційна італійська страва з макаронних виробів. Кількість калорій варіюється, але приблизно 400-500 калорій на порцію. Cacio e Pepe - це спагеті або інші макаронні вироби, заправлені вершковим соусом з сиру Пекоріно Романо, водою для приготування макаронів і великою кількістю свіжомеленого чорного перцю. Має насичений, пікантний і злегка гострий смак. Ця страва складається з варіння макаронів, приготування соусу шляхом розплавлення сиру та перцю у воді для макаронів, а потім занурення варених макаронів у цю вершкову суміш.  У більшості рецептів подається на 4 персони.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "12 унцій спагеті\n" +
                        "1 склянка тертого сиру Пекоріно Романо\n" +
                        "Свіжомелений чорний перець\n" +
                        "Сіль",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Відварити спагеті в підсоленій воді до стану аль денте.\n" +
                        "Залишити трохи води для варіння макаронів, а потім злити воду.\n" +
                        "На сковороді підсмажити чорний перець до аромату.\n" +
                        "Додайте воду для макаронів і доведіть до кипіння.\n" +
                        "Додати варені макарони та сир, перемішати до утворення кремоподібної маси.\n" +
                        "Подавати негайно, прикрасивши сиром і перцем.\n" +
                        "Зображення та детальні інструкції можна знайти у вказаних джерелах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 26,
            categoryOfFood = "Паста",
            dishTitle = "Папарделле з рагу з дикого кабана",
            imageResId = R.drawable.pappardelle_with_wild_boar_ragu_20,
            description =
            "Папарделле з кабанячим рагу - ароматна італійська страва з насиченим, ситним соусом.  Ця страва не підходить для вегетаріанців або веганів через використання м'яса дикого кабана. Вона також може не підійти людям з алергією на свинину. Папарделле з кабанячим рагу - це традиційна італійська страва з макаронів. Кількість калорій варіюється, але становить приблизно 500-600 калорій на порцію. У цій страві широкі плоскі макарони папарделле подаються з повільно приготованим рагу з ніжного м'яса дикого кабана, томатами, ароматними травами та червоним вином. Вона має міцний і пікантний смак. Цей рецепт передбачає приготування рагу шляхом підрум'янювання м'яса кабана, потім тушкування з іншими інгредієнтами і, нарешті, подачу з вареною пастою папарделле. У більшості рецептів подається на 4 персони.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "12 унцій пасти папарделле\n" +
                        "1 фунт м'яса дикого кабана\n" +
                        "1 банка подрібнених помідорів\n" +
                        "Червоне вино\n" +
                        "Цибуля, морква, селера, часник\n" +
                        "Оливкова олія\n" +
                        "Свіжі трави (наприклад, розмарин, чебрець)\n" +
                        "Сіль і чорний перець",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Підрум'янити м'ясо кабана на оливковій олії.\n" +
                        "Додати нарізані цибулю, моркву, селеру та часник, готувати до розм'якшення.\n" +
                        "Влити червоне вино і дати йому уваритися.\n" +
                        "Додати подрібнені помідори, зелень, сіль і перець, тушкувати, поки рагу не загусне.\n" +
                        "Зварити пасту папарделле та додати до рагу.\n" +
                        "Подавати гарячим, за бажанням прикрасивши тертим сиром.\n" +
                        "Детальні інструкції та зображення можна знайти у вказаних джерелах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 27,
            categoryOfFood = "Паста",
            dishTitle = "Паста з квасолею",
            imageResId = R.drawable.pasta_e_fagioli_33,
            description =
            "Паста та квасоля - італійський суп з макаронами та квасолею, який зазвичай не підходить для вегетаріанців через використання бекону або панчетти. Інших специфічних дієтичних обмежень страва не має. Це ситний і ароматний суп, що містить приблизно 200-250 калорій на порцію. Паста з квасолею - заспокійливий італійський суп з макаронами та квасолею на ароматному бульйоні, часто з помідорами, зеленню та беконом або панчеттою. Рецепти варіюються в залежності від порцій, підходять як для однієї людини, так і для сім'ї.",
            ingredients = listOf(
                "Інгредієнти (кількість може змінюватися залежно від рецепту):\n" ,
                        "Бекон або панчетта\n" +
                        "Цибуля\n" +
                        "Часник\n" +
                        "Помідори (консервовані або свіжі)\n" +
                        "Квасоля каннелліні\n" +
                        "Курячий або овочевий бульйон\n" +
                        "Діталіні або інші дрібні макарони\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець\n" +
                        "Італійські трави (наприклад, орегано, базилік)\n" +
                        "Тертий пармезан (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій каструлі обсмажте бекон або панчетту до хрусткої скоринки. Вийняти і відкласти в сторону.\n" +
                        "У тій же каструлі обсмажте цибулю та часник до розм'якшення.\n" +
                        "Додайте помідори, квасолю, бульйон і зелень. Тушкуйте, поки не змішаються смаки.\n" +
                        "Окремо відваріть макарони та додайте їх у суп.\n" +
                        "Посолити та поперчити.\n" +
                        "Подавати гарячим, прикрасивши хрустким беконом та тертим пармезаном за бажанням.\n" +
                        "Детальні інструкції можна знайти у наданих джерелах рецептів. Насолоджуйтесь цим смачним італійським супом!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 28,
            categoryOfFood = "Паста",
            dishTitle = "Лимонна Пвста",
            imageResId = R.drawable.lemon_paste_pasta_al_limone_86,
            description =
            "Паста аль лімоне, або лимонна паста, - це класична італійська страва, відома своєю простотою та чудовим смаком. Ця страва, як правило, складається з довгих макаронних виробів, таких як спагеті або феттучіні, приготованих до ідеального стану \"аль денте\". Особливістю цієї страви є вершково-лимонний соус. Соус готується з поєднання свіжовичавленого лимонного соку, лимонної цедри, вершкового масла, вершків і сиру пармезан, створюючи оксамитове і пікантне покриття для макаронів.",
            ingredients = listOf(
                "Інгредієнти\n" ,
                        "500 г макаронних виробів (наприклад, пікіс) \n" +
                        "1 склянка вершків\n" +
                        "50 г вершкового масла\n" +
                        "2 органічні лимони, терта цедра і весь сік\n" +
                        "½ чайної ложки солі\n" +
                        "трохи перцю",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Макарони: відварити макарони аль денте в киплячій підсоленій воді. підсоленій воді. " +
                        "Зарезервувати 1 літр води для варіння, відцідити макарони.\n" +
                        "2. Соус: у тій же каструлі довести до кипіння воду, вершки, вершкове масло, лимонну цедру та сік (близько 1,5 л). " +
                        "Зменшити вогонь і тушкувати приблизно 5 хвилин. Додати макарони, перемішати, тушкувати 2 хвилини, приправити.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 29,
            categoryOfFood = "Паста",
            dishTitle = "Ньоккі з фісташковим песто",
            imageResId = R.drawable.gnocchi_with_pistachio_pesto_pesto_87,
            description =
            "Ньоккі з фісташковим песто - вишукана італійська страва, яка поєднує в собі м'якість ньоккі з насиченим горіховим смаком фісташкового песто. Ньоккі, маленькі картопляні галушки, відварюють до готовності, а потім заливають вершково-фісташковим соусом песто. Цей соус зазвичай складається з мелених фісташок, свіжого базиліка, сиру пармезан, оливкової олії, часнику і трохи лимонного соку, створюючи гармонійне поєднання текстур і смаків.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "700 г картоплі крупного сорту, поділеної навпіл.\n" +
                        " 200 г білого борошна\n" +
                        "1 яйце\n" +
                        "1½ чайної ложки солі\n" +
                        "трохи перцю\n" +
                        "Кукурудзяний крохмаль для посипання\n" +
                        "180 г фісташок\n" +
                        "½ пучка базиліка\n" +
                        "3 ст.л. води\n" +
                        "1 органічний лайм, натерти цедру та 1 ст.л. соку\n" +
                        "100 г рікотти\n" +
                        "сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Формуємо ньокки: До картоплі додати борошно, яйце, сіль і перець та швидко перемішати. Розділити тісто на 4 частини, сформувати з них рулетики діаметром приблизно 1,5 см кожен у вигляді невеликого мейзена. Наріжте їх на шматочки довжиною близько 1 см.\n" +
                        "Песто: 2 столові ложки фісташок крупно нарізати, відкласти в сторону. Решту фісташок покласти в подрібнювач. Додати базилік і воду з цедрою і соком лайма, все перемішати. Додати рикотту і перемішати.\n" +
                        "Довести ньоккі до кипіння: кілька разів у підсоленій воді приблизно по 5 хвилин, поки вони не піднімуться на поверхню.\n" +
                        "Вийняти їх, відцідити воду і додати до песто. Додати 2 ст. води, перемішати і приправити. Розкласти ньоккі та посипати фісташками, що залишилися.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 30,
            categoryOfFood = "Паста",
            dishTitle = "Спагеті  Салерно",
            imageResId = R.drawable.spaghetti_in_salerno_style_89,
            description =
            "Спагеті по-салернськи, або \"Спагеті ала салернітана\" - це вишукана італійська страва з макаронних виробів, що походить з прибережного міста Салерно в регіоні Кампанія. Ця страва відображає суть південної італійської кухні, відомої своїм використанням свіжих та яскравих інгредієнтів.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "  3 ст.л панірувальних сухарів\n" +
                        "½ пучка подрібненої петрушки\n" +
                        "160 г сиру пармезан\n" +
                        "3 столові ложки оливкової олії\n" +
                        "подрібнених зубчиків часнику\n" +
                        "½ чайної ложки пластівців чилі\n" +
                        "500 г спагетті\n" +
                        "  4 яйця\n" +
                        "сіль і перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Спагеті: відварити спагеті аль денте в підсоленій воді.\n" +
                        "Соус: додайте до спагеті 1 столову ложку оливкової олії\n" +
                        "Як приготувати фрізуру: підсмажте панірувальні сухарі на антипригарній сковороді \n" +
                        "на антипригарній сковорідці та перелийте в миску. Додайте петрушку та 3 столові ложки тертого сиру і перемішайте.\n" +
                        "Часникова олія: розігріти олію в тій же сковороді, додати часник і \n" +
                        "пластівці чилі, обсмажуємо протягом 4 хвилин, відставляємо на \n" +
                        "плиту. Додайте воду для пасти з часниковою олією та решту тертого сиру. Повільно нагріти спагетті, помішуючи, поки соус не стане кремоподібним.\n" +
                        "Яєчня: як приготувати На тій же сковороді розігріти олію, розбити куфи по одному \n" +
                        "по одному, покладіть їх у сковороду і смажте на повільному вогні приблизно 3 хвилини. \n" +
                        "Подавати зі спагеті з яєчнею, посипати картоплею фрі, приправити.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 32,
            categoryOfFood = "Основні страви",
            dishTitle = "Особуко",
            imageResId = R.drawable.osobuko_32,
            description =
            "Особуко - класична італійська страва, відома своїми наваристими та ніжними тушкованими телячими гомілками. Оссо Буко не підходить для вегетаріанців або веганів через використання м'яса. Вона також може не підходити людям з алергією на яловичину або телятину. Оссо Буко - це традиційна італійська тушкована м'ясна страва. Кількість калорій варіюється, але становить приблизно 350-400 калорій на 1 порцію (близько 6 унцій м'яса з соусом). Оссо Буко складається з товстих телячих гомілок, які повільно готуються в ароматному соусі з томатів, білого вина, бульйону, цибулі, часнику та зелені. Страва відома своїм ніжним м'ясом, що відпадає від кістки, та ароматним соусом. У цьому рецепті телячі гомілки обсмажують, пасерують з ароматними овочами, заливають білим вином, додають томати та бульйон і тушкують до готовності, поки гомілки не стануть м'якими. У більшості рецептів подають на 4 персони.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 телячі гомілки (товщиною близько 2 дюймів)\n" +
                        "Борошно для днопоглиблювальних робіт\n" +
                        "Оливкова олія\n" +
                        "Цибуля, морква, селера, часник\n" +
                        "Біле вино\n" +
                        "Консервовані помідори\n" +
                        "Курячий або яловичий бульйон\n" +
                        "Свіжа зелень (наприклад, чебрець, розмарин)\n" +
                        "Гремолата на гарнір (лимонна цедра, часник, петрушка)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Обваляйте телячі гомілки в борошні та підрум'яньте на оливковій олії.\n" +
                        "Обсмажити цибулю, моркву, селеру та часник.\n" +
                        "Влити біле вино.\n" +
                        "Додаємо консервовані томати, бульйон і зелень, тушкуємо.\n" +
                        "Варити, поки м'ясо не стане м'яким (близько 2 годин).\n" +
                        "Подавати гарячим, прикрасивши гремолатою.\n" +
                        "Детальні інструкції та зображення можна знайти у наданих джерелах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 33,
            categoryOfFood = "Основні страви",
            dishTitle = "Сальтімбокка",
            imageResId = R.drawable.saltimbokka_33_small,
            description =
            "Сальтімбокка - це італійська страва, що складається з тонко нарізаної телятини, прошутто та листя шавлії, які загортають разом і зазвичай готують у білому вині. Традиційно для сальтимоки використовується телятина, яка може не підходити для тих, хто уникає червоного м'яса. Однак ви можете приготувати варіації, використовуючи курку або індичку, залежно від ваших дієтичних уподобань. Сальтімбокка - класична італійська страва, відома своїм пікантним і ароматним смаком. Кількість калорій варіюється, але становить приблизно 300-400 калорій на 1 порцію (з телятини).  Сальтімбокка перекладається як \"стрибає в роті\", описуючи смакове поєднання ніжної телятини, солоної прошутто та ароматного шавлії. Зазвичай за цим рецептом телятину або інше м'ясо тонко відбивають, солять, додають листочок шавлії та скибочку прошутто, закріплюють зубочистками і обсмажують на сковороді у вершковому маслі та білому вині. У більшості рецептів подається 4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 телячі скалопіні (або інше м'ясо, наприклад, курка)\n" +
                        "4 скибочки прошутто\n" +
                        "4 листочки свіжої шавлії\n" +
                        "Сіль і перець\n" +
                        "Біле вино\n" +
                        "Вершкове масло\n" +
                        "Зубочистки для закріплення",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Посоліть м'ясо та поперчіть.\n" +
                        "На кожен шматочок м'яса покласти по листочку шавлії, а зверху - скибочку прошутто.\n" +
                        "Закріплюємо шари зубочистками.\n" +
                        "Розігріваємо вершкове масло, додаємо м'ясо і смажимо до рум'яної скоринки.\n" +
                        "Сковороду змащуємо білим вином і готуємо до готовності м'яса.\n" +
                        "Подавати гарячим.\n" +
                        "Детальніші інструкції та варіації ви можете знайти в наданих джерелах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 34,
            categoryOfFood = "Основні страви",
            dishTitle = "Баклажани з пармезаном",
            imageResId = R.drawable.baklazhany_z_parmezanom_34_small,
            description =
            "Баклажани з пармезаном або парміджана ді меланзане - класична італійська страва, відома своїми шарами панірованих і обсмажених скибочок баклажанів, соусом маринара та сиром. Ця страва, як правило, підходить для вегетаріанців, але не для веганів через використання сиру та яєць. Це ситна, запечена італійська запіканка з шарами баклажанів, томатного соусу та сиру. Кількість калорій залежить від способу приготування, але зазвичай становить близько 300-400 калорій на 1 порцію. Баклажани з пармезаном - це хрусткі обсмажені скибочки баклажанів з насиченим соусом маринара та сумішшю плавлених сирів, які створюють пікантну та ситну страву. За цим рецептом скибочки баклажанів панірують і обсмажують, перешаровують соусом маринара та сиром моцарела і запікають до утворення рум'яної скоринки. У більшості рецептів подається на 4 персони.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 великі баклажани\n" +
                        "Сіль\n" +
                        "Борошно для днопоглиблювальних робіт\n" +
                        "Яйця, для миття яєць\n" +
                        "Хлібні крихти\n" +
                        "Оливкова олія для смаження\n" +
                        "Соус Маринара\n" +
                        "Сир моцарела\n" +
                        "Сир пармезан\n" +
                        "Свіже листя базиліка",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Баклажани нарізати кружальцями, посолити і дати постояти, щоб стекла зайва волога.\n" +
                        "Обваляйте в борошні, вмочіть у збиті яйця та запаніруйте в панірувальних сухарях.\n" +
                        "Обсмажуємо скибочки баклажанів до золотистої скоринки.\n" +
                        "У форму для запікання викласти шарами обсмажені баклажани, соус маринара, моцарелу, пармезан і базилік.\n" +
                        "Повторювати шари, завершуючи зверху сиром і соусом.\n" +
                        "Запікати, доки сир не розплавиться і не почне пузиритися.\n" +
                        "За детальними інструкціями ви можете звернутися до наданих джерел.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 35,
            categoryOfFood = "Основні страви",
            dishTitle = "Куряча марсала",
            imageResId = R.drawable.kuriacha_marsala_35,
            description =
            "Куряча марсала - класична італійська страва, відома своїм пікантним смаком. Зазвичай вона містить обсмажені на сковороді курячі котлети, гриби та винний соус \"Марсала\". У джерелах нічого не згадується. Джерела не вказують конкретну кількість калорій, але вона може варіюватися залежно від розміру порції та використовуваних інгредієнтів. Куряча марсала - це ніжні курячі котлети, приготовані з земляними грибами в насиченому винному соусі \"Марсала\", в результаті чого виходить чудова, ароматна страва. Рецепти розраховані на 4 порції.",
            ingredients = listOf(
                "Інгредієнти:" ,
                        " 4 курячі грудки без кісток, без шкіри\n" +
                        "1/2 склянки універсального борошна\n" +
                        "Сіль і перець за смаком\n" +
                        "2 столові ложки оливкової олії\n" +
                        "8 унцій грибів, нарізаних скибочками\n" +
                        "1/2 склянки вина Марсала\n" +
                        "1/2 склянки курячого бульйону\n" +
                        "2 столові ложки вершкового масла\n" +
                        "Свіжа петрушка для прикраси",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Відбити курячі грудки до рівномірної товщини.\n" +
                        "Посолити, поперчити, обваляти в борошні.\n" +
                        "У сковороді розігріти оливкову олію, обсмажити курку до золотистого кольору і перекласти на тарілку.\n" +
                        "У тій же сковороді обсмажуємо гриби.\n" +
                        "Додаємо вино Марсала та курячий бульйон, тушкуємо.\n" +
                        "Повернути курку в сковороду і готувати до готовності.\n" +
                        "Додайте вершкове масло і прикрасьте блюдо петрушкою.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 36,
            categoryOfFood = "Основні страви",
            dishTitle = "Теляча пікката",
            imageResId = R.drawable.teliata_pikatta_36_small,
            description =
            "Теляча пікката - чудова італійська страва з ніжними телячими котлетами у лимонно-вершковому соусі.  Основна страва. У джерелах не згадується. Джерела не вказують конкретну кількість калорій, але вона може змінюватися залежно від розміру порції та використовуваних інгредієнтів.  Теляча пікката - класична італійська страва, відома своїм ніжним смаком. У ній поєднуються тонко відрубані телячі котлети, пікантний лимонно-вершковий соус і каперси для пікантного та пікантного смаку. Рецепт розрахований на 4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 котлети з телятини\n" +
                        "Сіль і перець за смаком\n" +
                        "1/2 склянки універсального борошна\n" +
                        "2 столові ложки оливкової олії\n" +
                        "2 столові ложки несолоного вершкового масла\n" +
                        "1/4 склянки свіжого лимонного соку\n" +
                        "1/4 склянки курячого бульйону\n" +
                        "2 столові ложки каперсів\n" +
                        "Нарізана свіжа петрушка для прикраси",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Телячі котлети посолити, поперчити, обваляти в борошні.\n" +
                        "У сковороді розігріти оливкову олію, обсмажити телятину до золотистої скоринки та перекласти на тарілку.\n" +
                        "У тій же сковороді розтоплюємо вершкове масло, додаємо лимонний сік, курячий бульйон і каперси. Готуємо, поки соус злегка не загусне.\n" +
                        "Повертаємо телятину в сковороду, поливаємо соусом і тушкуємо кілька хвилин.\n" +
                        "Прикрашаємо подрібненою петрушкою та подаємо до столу.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 37,
            categoryOfFood = "Основні страви",
            dishTitle = "Брачіола",
            imageResId = R.drawable.bracciolla_37_small,
            description =
            "Брачіола - італійська страва, що складається з тонких шматочків яловичини або свинини, загорнутих в рулетики з ароматною начинкою, часто тушкованою в томатному соусі. Основна страва. Сама по собі брачіола не має особливих дієтичних обмежень, але можуть існувати варіації. Кількість калорій може змінюватися залежно від інгредієнтів та розміру порції, але зазвичай становить від 200 до 400 калорій на порцію. Брачіола - це тонко нарізане м'ясо, обгорнуте навколо начинки з панірувальних сухарів, сиру, зелені та іноді прошутто. М'ясо тушкується в томатному соусі до готовності, створюючи пікантну і ситну класичну італійську страву. Зазвичай ця страва розрахована на 4-х осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тонко нарізана яловичина або свинина\n" +
                        "Хлібні крихти\n" +
                        "Тертий пармезан\n" +
                        "Свіжа петрушка\n" +
                        "Часник\n" +
                        "Прошутто (за бажанням)\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець\n" +
                        "Томатний соус",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Викладіть шматочки м'яса на плоску тарілку, посоліть і поперчіть.\n" +
                        "На кожну скибочку викласти суміш панірувальних сухарів, пармезану, петрушки, часнику та прошутто.\n" +
                        "Поверніть скибочки рулетом, закріпивши їх зубочистками.\n" +
                        "На сковороді розігріваємо оливкову олію та підрум'янюємо рулетики.\n" +
                        "Залити томатним соусом і тушкувати до готовності (близько 12 годин).\n" +
                        "Перед подачею вийняти зубочистки.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 38,
            categoryOfFood = "Основні страви",
            dishTitle = "Порчетта",
            imageResId = R.drawable.porchetta_38_small,
            description =
            "Порчетта - італійська страва зі смаженої свинини, відома своєю хрусткою шкіркою та ароматною начинкою. Вона не має особливих дієтичних обмежень, але це ситна страва. Порчетта - це італійська вулична їжа, яка містить приблизно 400-600 калорій на порцію. Порчетта готується шляхом фарширування обваленої свині часником, травами та спеціями, потім її згортають, перев'язують і смажать, поки шкіра не потріскається, а м'ясо не стане м'яким. Рецепти, як правило, розраховані на велику компанію через розмір печені, часто 12 або більше порцій",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Свиняча частина або корейка без кісток.\n" +
                        "Часник, розмарин, насіння фенхелю та інші трави та спеції.\n" +
                        "Сіль і перець.\n" +
                        "Оливкова олія.\n" +
                        "Деякі рецепти можуть містити лимонну цедру або інші варіанти.",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Змащуємо свинячу черевце вершковим маслом.\n" +
                        "Приправляємо сіллю, перцем, часником і травами.\n" +
                        "Щільно скручуємо рулетом, перев'язуємо кухонним шпагатом.\n" +
                        "Запікаємо в гарячій духовці до хрусткої скоринки та повної готовності.\n" +
                        "Нарізати і подавати як основну страву або на бутербродах.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 39,
            categoryOfFood = "Основні страви",
            dishTitle = "Фарширований болгарський перець",
            imageResId = R.drawable.farshyrovanyj_bolg_perec_39,
            description =
            "Фаршировані болгарські перці - чудова італійська страва, в якій болгарський перець наповнюють пікантною сумішшю. Вони можуть бути адаптовані до різних дієтичних обмежень. Ця італійська версія зазвичай містить близько 300-400 калорій на порцію. Фарширований болгарський перець - це болгарський перець, наповнений ароматною сумішшю з меленого м'яса, рису, овочів і зелені. Перець запікають, поки він не стане м'яким, створюючи ситну страву на одну страву. Рецепт розрахований на 4 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 великих болгарських перці (червоний, зелений або жовтий)\n" +
                        "1 фунт м'ясного фаршу (яловичина, індичка або свинина)\n" +
                        "1 склянка вареного рису\n" +
                        "1 невелика цибулина, дрібно нарізана\n" +
                        "2 зубчики часнику, подрібнені\n" +
                        "1 банка нарізаних кубиками помідорів\n" +
                        "1/2 склянки томатного соусу\n" +
                        "Італійська приправа, сіль, перець\n" +
                        "Тертий пармезан (за бажанням)\n" +
                        "Свіжий базилік або петрушка для прикраси",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігріти духовку до 350°F (175°C).\n" +
                        "Зріжте верхівки перців, видаліть насіння та бланшуйте їх у киплячій воді протягом декількох хвилин.\n" +
                        "На сковороді спасерувати цибулю та часник, додати м'ясо і готувати, поки не підрум'яниться.\n" +
                        "Додаємо рис, нарізані кубиками помідори, італійську приправу, сіль та перець. Готуємо кілька хвилин.\n" +
                        "Нафаршируйте перець м'ясо-рисовою сумішшю.\n" +
                        "Викласти фаршировані перці у форму для запікання, полити томатним соусом і накрити фольгою.\n" +
                        "Запікати приблизно 45 хвилин до години, поки перець не стане м'яким.\n" +
                        "За бажанням, перед подачею посипати сиром пармезан і прикрасити свіжою зеленню.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 40,
            categoryOfFood = "Основні страви",
            dishTitle = "Бістека ала Фіорентіна - Флорентійський стейк",
            imageResId = R.drawable.bisteka_ala_fiorentina,
            description =
            "Бістека ала Фіорентіна - це класична італійська страва, відома своєю простотою та виразним смаком. Вона складається з товстого стейку T Bone або портергауза, який грилюється до ідеального ступеня. У цій страві відсутні конкретні обмеження дієти, що робить її справжньою насолодою для м'ясоїдів. Один порція містить приблизно 800-1000 калорій. Бістека ала Фіорентіна - це флорентійський стейк, який обсмажують на високій температурі, щоб створити хрустку корку, при цьому залишаючи середину рідкісною. Він приправляється сіллю, перцем і оливковою олією, що дозволяє смаку м'яса блищати. Один стейк зазвичай подають на 2-4 осіб, залежно від розміру.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 або більше стейків з Т-подібної кістки або біфштексів (товщиною приблизно 1,5-2 дюйми)\n" +
                        "Високоякісна оливкова олія\n" +
                        "Крупна морська сіль\n" +
                        "Свіжомелений чорний перець",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Дістати стейк з холодильника щонайменше за 30 хвилин до приготування.\n" +
                        "Розігріти гриль або чавунну сковорідку на сильному вогні.\n" +
                        "Щедро приправити стейк крупною морською сіллю та свіжомеленим чорним перцем.\n" +
                        "Збризніть стейк оливковою олією.\n" +
                        "Покладіть стейк на гарячий гриль або сковорідку.\n" +
                        "Готуйте по 35 хвилин з кожного боку для прожарювання або довше для бажаної готовності.\n" +
                        "Перед нарізанням дайте йому відпочити кілька хвилин.\n" +
                        "Подавайте нарізаний стейк з оливковою олією і, за потреби, досолити.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 41,
            categoryOfFood = "Основні страви",
            dishTitle = "Риба у шаленій воді - Pesce all'Acqua Pazza",
            imageResId = R.drawable.ryba_u_shalenij_vodi,
            description =
            "Pesce all'Acqua Pazza, або \"Риба у шаленій воді\" - традиційна італійська страва з морепродуктів, відома своїм легким та ароматним бульйоном. Зазвичай вона не пов'язана з особливими дієтичними обмеженнями, що робить її придатною для різних дієт. У цій страві біла риба тушкується в ароматному томатному бульйоні з травами та спеціями. Кожна порція містить приблизно 150-200 калорій. Pesce all'Acqua Pazza - це проста, але елегантна страва, де біла риба ніжно припущена в бульйоні з томатів, оливкової олії, часнику, перцю чилі та свіжої зелені. Вона відома своїми яскравими смаками та ніжною текстурою. Рецепт зазвичай розрахований на 2-4 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 філе білої риби (наприклад, окунь, морський окунь або тріска)\n" +
                        "2 склянки нарізаних кубиками помідорів (консервованих або свіжих)\n" +
                        "4 зубчики часнику, подрібнені\n" +
                        "1/2 склянки оливкової олії першого віджиму\n" +
                        "1/2 чайної ложки пластівців червоного перцю (за смаком)\n" +
                        "Свіже листя базиліка\n" +
                        "Свіже листя петрушки\n" +
                        "Сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій сковороді розігрійте оливкову олію на середньому вогні.\n" +
                        "Додайте подрібнений часник і пластівці червоного перцю; обсмажте до появи аромату.\n" +
                        "Додайте нарізані кубиками помідори, посоліть, поперчіть і готуйте кілька хвилин.\n" +
                        "Покладіть рибне філе в сковороду і викладіть ложкою трохи томатної суміші.\n" +
                        "Накрити кришкою і тушкувати приблизно 10-15 хвилин або до повної готовності риби.\n" +
                        "Прикрасити свіжим базиліком і петрушкою.\n" +
                        "Подавати рибу з томатним бульйоном, политим зверху ложкою.\n" +
                        "За більш детальними інструкціями ви можете звернутися до наданих джерел рецептів. Насолоджуйтесь цією чудовою італійською стравою з морепродуктів!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 42,
            categoryOfFood = "Основні страви",
            dishTitle = "Італійський салат з квасолі",
            imageResId = R.drawable.italijskyj_salat_z_kvasoli_42,
            description =
            "Італійський квасолевий салат, який часто називають \"Insalata di Fagioli\", - це освіжаюча та поживна страва, яка оспівує простоту середземноморської кухні. Цей салат, як правило, містить білу квасолю, таку як каннелліні або квасоля північна, як головний інгредієнт. Ця квасоля поєднується зі свіжими овочами та зеленню, включаючи помідори, червону цибулю, болгарський перець і петрушку.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        " 1 чайна ложка діжонської гірчиці\n" +
                        "5 столових ложок червоного винного оцту\n" +
                        "4 столові ложки оливкової олії \n" +
                        "1 нарізана червона цибуля\n" +
                        "1 подрібнений зубчик часнику\n" +
                        "1 банка філе анчоусів (близько 25 г), відціджена, дрібно нарізана \n" +
                        "трохи перцю\n" +
                        "2 банки білої квасолі (близько 400 г кожна), промити і відцідити\n" +
                        "500 г помідорів черрі, розрізаних на четвертинки\n" +
                        "½ пучка крупно нарізаного орегано\n" +
                        "500 g of cherry tomatoes, cut into quarters\n" +
                        "½ bunch of coarsely chopped oregano",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Соус: змішати гірчицю, оцет та олію в салатнику. Додати цибулю, часник і анчоуси, перемішати і заправити.\n" +
                        "Салат: до соусу з квасолею, помідорами та орегано додати квасолю та помідори, перемішати та заправити.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 43,
            categoryOfFood = "Основні страви",
            dishTitle = "Тефтелі по-неаполітанськи \"Polpette alla Napoletana\"",
            imageResId = R.drawable.polpette_alla_napoletana_43,
            description =
            "Неаполітанські фрикадельки, або \"Polpette alla Napoletana\" - класична італійська страва, що походить з Неаполя, Італія. Ці фрикадельки відомі своєю ситністю та ароматом. Зазвичай їх готують із суміші яловичого та свинячого фаршу, приправляють часником, петрушкою та тертим сиром пармезан. Фрикадельки часто обсмажують на сковороді до золотистої скоринки, що надає їм насиченого пікантного смаку.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "300 г м'ясного фаршу (яловичини)\n" +
                        "180 г сальтисону, видалити м'якоть і нарізати шматочками\n" +
                        "2 подрібнені зубчики часнику\n" +
                        "1 дрібно нарізана цибулина\n" +
                        "1 яйце\n" +
                        "2 ст.л. панірувальних сухарів\n" +
                        "40 г тертого пармезану\n" +
                        "½ пучка подрібненої петрушки\n" +
                        "½ ч.л. солі\n" +
                        "трохи перцю\n" +
                        "оливкова олія для приготування\n" +
                        "1 дрібно нарізана цибулина\n" +
                        "1 подрібнений зубчик часнику\n" +
                        "1 ст.л. томатного пюре\n" +
                        "800 г м'ясистих помідорів,\n" +
                        "нарізаних скибочками\n" +
                        "3 гілочки орегано\n" +
                        "½ столової ложки цукру\n" +
                        "34 чайні ложки солі",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Фрикадельки: Змішати м'ясо та всі інгредієнти, включно з перцем. " +
                        "Добре вимісити руками до отримання компактної маси. Зліпити мокрими руками приблизно 16 фрикадельок. \n" +
                        "2. Соус: Нагріти трохи олії на антипригарній сковороді. " +
                        "Обсмажте фрикадельки з усіх боків у кілька прийомів протягом 8 хвилин. " +
                        "Виймаємо їх зі сковороди та відкладаємо в сторону. У тій же сковороді розігріти трохи олії. " +
                        "Обсмажуємо цибулю та часник протягом 2 хвилин. Додайте томатне пюре і продовжуйте смажити ще 1 хвилину. " +
                        "Додати помідори, орегано і цукор, приправити і довести до кипіння. " +
                        "Зменшити вогонь, накрити кришкою і тушкувати близько 15 хвилин, періодично помішуючи. " +
                        "Повернути фрикадельки в сковороду та підігріти.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 44,
            categoryOfFood = "Основні страви",
            dishTitle = "Дорадо з літніми овочами",
            imageResId = R.drawable.darado_z_litnimy_ovochamy_44,
            description =
            "Дорадо, також відома як махі-махі, - популярна риба, відома своїм м'яким смаком і універсальністю в приготуванні. У поєднанні з літніми овочами рибу зазвичай готують на грилі або запікають і подають разом зі свіжими сезонними овочами, такими як помідори, болгарський перець, цукіні та зелень. Овочі додають страві яскравих барв, а риба забезпечує ніжний і злегка солодкуватий смак. Це легка і корисна страва, яка втілює аромати літа, що робить її чудовим вибором для вечері в теплу пору року.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "75 г чорних оливок без кісточок,\n" +
                        "розрізані навпіл\n" +
                        "2 столові ложки відціджених каперсів\n" +
                        "1 пучок плоскої петрушки, нарізаний\n" +
                        "1 столова ложка подрібненого розмарину\n" +
                        "1 столова ложка подрібненого орегано\n" +
                        "4 чайні ложки\n" +
                        "сіль, трохи перцю\n" +
                        "1 столова ложка оливкової олії\n" +
                        "50 г панірувальних сухарів\n" +
                        "1 подрібнений зубчик часнику\n" +
                        "1 органічний лимон, натерта цедра\n" +
                        "4 гілочки чебрецю\n" +
                        "2 щіпки солі\n" +
                        "1 столова ложка оливкової олії\n" +
                        "4 філе морського ляща (приблизно 150 г кожне)\n" +
                        "½ чайної ложки солі\n" +
                        "трохи перцю\n" +
                        " 3 жовті болгарські перці, нарізані шматочками\n" +
                        "400 г помідорів черрі, розрізаних навпіл\n" +
                        "75 г зелених оливок без кісточок, розрізаних навпіл",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                "1.Панграттато (смажені борошняні крихти): Розігрійте олію в антипригарній сковороді. " +
                        "Знизьте вогонь, додайте борошняні крихти, часник, цедру лимона і тим'ян, смажте протягом 4 хвилин, помішуючи час від часу, соліть за смаком. " +
                        "Видаліть гілку тим'яну, дайте охолонути.\n" +
                        "2.Овочі: розігрійте олію в тій же сковороді. Смажте перці протягом 5 хвилин, потім томати приблизно 5 хвилин. " +
                        "Додайте оливки та всі інгредієнти, включаючи перець, добре перемішайте і поділіть між тарілками.\n" +
                        "3.Дорадо: Розігрійте олію в антипригарній сковороді. Приправте філе риби соллю і перцем, смажте зі шкіркою 3 хвилини. " +
                        "Поверніть їх і продовжуйте смажити ще 1 хвилину. Розкладіть філе на овочі та посипте смаженими борошняними крохмалі.\n" +
                        "Подавайте з запеченими картоплею.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 45,
            categoryOfFood = "Основні страви",
            dishTitle = "Морський окунь з томатами і білим вином",
            imageResId = R.drawable.morskii_okun_z_tomatamy_45,
            description =
            "Морський окунь з помідорами та білим вином - чудова страва з морепродуктів, відома своїми яскравими смаковими якостями. Як правило, це свіже філе морського окуня, обсмажене на сковороді до ідеальної консистенції, яке подається з ароматним томатним соусом. Соус часто готують з помідорами черрі, часником, травами та білим вином, що додає страві глибини та складності. Таке поєднання створює гармонійне поєднання ніжного хрусткого морського окуня та пікантної солодкості томатів, збалансованої кислотністю вина. Це популярний вибір для тих, хто цінує вишуканий смак морепродуктів у поєднанні з яскравими, пікантними нотками томатів і білого вина. Ця страва демонструє універсальність морського окуня, що робить його фаворитом середземноморської та сицилійської кухонь.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "300 г помідорів черрі на виноградній лозі\n" +
                        "400 г філе морського окуня з кісткою\n" +
                        "3 зубчики часнику, подрібнені\n" +
                        "½ пучка плоскої листової петрушки\n" +
                        "1 склянка білого вина\n" +
                        "2 столові ложки оливкової олії\n" +
                        "4 чайні ложки солі\n" +
                        "трохи перцю\n" +
                        "1 органічний лимон, нарізаний скибочками\n" +
                        "Для форми приблизно на 21 змащену олією форму для запікання",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Риба з помідорами: у підготовлену форму викласти помідори, рибу, часник і петрушку. " +
                        "Змішати вино та олію, приправити та полити сумішшю рибу з помідорами.\n" +
                        "2. Приготування: готувати близько 20 хвилин у верхній частині духовки, розігрітої до 220°C. " +
                        "Вийняти з духовки і подавати з часточками лимона. Подавати з хлібом.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 46,
            categoryOfFood = "Основні страви",
            dishTitle = "Гратен з кабачків зі Скаморцо",
            imageResId = R.drawable.graten_z_kabachkiv_slamorzi_46,
            description =
            "Гратен з кабачків зі Скаморцо - це смачна і затишна страва з кабачків та сиру Скаморцо. Зазвичай ця страва включає тонко нарізані кабачки, які часто укладаються у формі для запікання та запікаються до досконалості з вершковим соусом з сиру Скаморцо, який є напівм'яким італійським сиром, схожим на моцарелу, але з більш насиченим смаком. Сирний соус обволікає кабачки, створюючи кремовий, солоний та трохи димчастий смак. Зазвичай його приправляють травами, часником і борошном, щоб додати текстури і смаку. Страву потім запікають до утворення золотисто-коричневої корки. Це чудовий спосіб насолодитися природною солодкістю кабачків та розкішчю розтопленого сиру, що робить її улюбленою гарніром або навіть основною стравою в італійській кухні.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "500 г кабачків, нарізаних в довгі смужки приблизно 5 мм завширшки\n" +
                        "500 г жовтих кабачків, нарізаних в довгі смужки приблизно 5 мм завширшки\n" +
                        "2 столові ложки оливкової олії\n" +
                        "½ чайної ложки солі\n" +
                        "400 г картоплі, нарізаної на тонкі кружечки приблизно 3 мм завтовшки\n" +
                        "1 нарізаний зубчик часнику\n" +
                        "½ пучка нарізаної м'яти\n" +
                        "1 столова ложка оливкової олії\n" +
                        "¼ чайної ложки солі\n" +
                        "трохи перцю\n" +
                        "300 г моцарели, грубо натертої\n" +
                        "250 г копченої скаморці, грубо натертої\n" +
                        "2 столові ложки борошна\n" +
                        "1 столова ложка оливкової олії\n" +
                        "Для форми приблизно 21 запіканки, змащеної олією.",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        " 1. Кабачки: Викласти кабачки на два дека, застелених папером для випічки. Збризнути олією та сіллю, добре перемішати.\n" +
                        "2. Приготування: готувати близько 20 хвилин у попередньо розігрітій до 200°C духовці (конвекційний нагрів). Вийняти кабачки з духовки і знову довести температуру до 200°C (верхній і нижній нагрів).\n" +
                        "3. Картопля: змішати картоплю з усіма інгредієнтами, включаючи перець.\n" +
                        "4. Запіканка: розподілити кабачки, ½ картоплі та сир у формі для запікання. Повторіть операцію двічі, закінчуючи сиром. Змішати панірувальні сухарі з олією та посипати запіканку.\n" +
                        "5. Приготування: готувати приблизно 35 хвилин в середині розігрітої духовки.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 47,
            categoryOfFood = "Основні страви",
            dishTitle = "Стейк і середземноморські овочі",
            imageResId = R.drawable.steik_z_ovochamy_47,
            description =
            "Страва \"Стейк з середземноморськими овочами\" - це ароматна та корисна страва, яка поєднує в собі насичений смак стейка та яскраві аромати середземноморських овочів. Зазвичай для цієї страви використовується соковитий шматок стейка, наприклад, філейна частина або рибай, приготований до бажаного ступеня готовності. До стейка додається асорті з середземноморських овочів, таких як помідори, болгарський перець, цукіні та червона цибуля. Ці овочі часто приправляють середземноморськими травами та спеціями, такими як орегано, чебрець і часник, створюючи чудове ароматне поєднання. Страва відома своїм збалансованим смаком, ніжним стейком і користю для здоров'я, пов'язаною з середземноморською дієтою, що робить її смачним і поживним вибором для тих, хто шукає ситну, але корисну їжу.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1% чайна ложка трав'яної солі\n" +
                        "трохи перцю\n" +
                        "½ чайної ложки трав'яної солі\n" +
                        "2 столові ложки оливкової олії\n" +
                        "1 зубчик часнику, подрібнений\n" +
                        "1 ст.л. листя розмарину, трохи меленого перцю\n" +
                        "2 антрекоти з яловичини (приблизно по 200 г)\n" +
                        "50 г руколи\n" +
                        "4 чайні ложки флер де сел\n" +
                        "2 столові ложки оливкової олії",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Маринад: добре змішайте олію, часник, розмарин і перець. Помажте м'ясо цим маринадом і залиште його маринувати приблизно 1 годину під кришкою у холодильнику. Вийміть м'ясо з холодильника за 30 хвилин до приготування.\n" +
                        "Овочі і м'ясо: трохи розігрійте олію в антипригарній сковороді. Половинки кабачків (приблизно 500 г) розріжте вдовж, а потім наріжте на кружечки приблизно 5 мм завтовшки. 2 баклажани розріжте вдовж, а потім наріжте на кружечки приблизно 5 мм завтовшки. Додайте часник, цедру лимона, розмарин і лавровий лист. Посоліть та продовжуйте готувати ще приблизно 10 хвилин на середньому вогні. Переложіть овочі в велику миску та закрийте кришкою. В тій же сковороді розігрійте трохи оливкової олії.\n" +
                        "Злущіть маринад, посоліть м'ясо і обсмажте його приблизно 1 хвилину з кожного боку, перевертаючи лише тоді, коли утворюється корка. Зменште вогонь і продовжуйте готувати ще приблизно 1½ хвилини з кожного боку на середньому вогні. Залиште під кришкою приблизно 5 хвилин.\n" +
                        "Подавання: додайте руколу до овочів, полийте залишеним лимонним соком. Наріжте м'ясо перпендикулярно до напрямку волокон і подавайте на тарілках разом з овочами. Посоліть м'ясо і полийте олією.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 48,
            categoryOfFood = "Основні страви",
            dishTitle = "Сицилійський хліб",
            imageResId = R.drawable.sicylijskyj_chlib_48,
            description =
            "Pane Siciliano - традиційний сицилійський хліб, відомий своїм сільським виглядом і чудовим смаком. Дієтичні обмеження: У результатах пошуку не згадано жодних конкретних дієтичних обмежень, але загалом він підходить для більшості дієт, якщо у вас немає специфічної алергії або непереносимості. Pane Siciliano - вид італійського хліба. Кількість калорій на порцію: Точна кількість калорій може змінюватися залежно від розміру порції, але типова порція хліба становить близько 80-100 калорій. Короткий опис: Pane Siciliano - це сільський італійський хліб круглої форми з хрусткою скоринкою та м'якою, повітряною серединою. Він має злегка жувальну текстуру і м'який, горіховий смак. Кількість порцій залежить від рецепту, але зазвичай він розрахований на 4-6 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "500г борошна грубого помелу\n" +
                        "10г солі\n" +
                        "15г цукру\n" +
                        "7 г активних сухих дріжджів\n" +
                        "300 мл теплої води\n" +
                        "30мл оливкової олії\n" +
                        "Кунжут (за бажанням для посипання)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У теплій воді розчиняємо дріжджі та цукор. Дати постояти 5 хвилин до утворення піни.\n" +
                        "У великій мисці змішати борошно і сіль. Додайте дріжджову суміш та оливкову олію.\n" +
                        "Вимішуйте тісто близько 10 хвилин, поки воно не стане гладким та еластичним.\n" +
                        "Покладіть тісто в змащену олією миску, накрийте тканиною і залиште на 1-2 години підніматися, поки воно не збільшиться вдвічі.\n" +
                        "Розігрійте духовку до 220°C (430°F).\n" +
                        "Пробийте тісто і надайте йому форму круглої буханки. За бажанням можна посипати зверху кунжутом.\n" +
                        "Випікайте 25-30 хвилин, доки хліб не стане золотисто-коричневим і не видасть порожнистого звуку при постукуванні по дну.\n" +
                        "Дайте йому охолонути перед тим, як нарізати і подавати до столу.\n" +
                        "Насолоджуйтесь домашнім сицилійським хлібом!",
            )
        ),

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 49,
            categoryOfFood = "Основні страви",
            dishTitle = "Смажений свинячий рулет",
            imageResId = R.drawable.smazenyi_svyniachyj_rulet_49,
            description =
            "Ці рулети глибоко смажаться до золотисто-коричневого кольору і хрусткості. Результатом є чудовий контраст між хрустким, смаженим зовнішнім шаром і ніжним, смачним внутрішнім наповненням. Смажені свинячі рулети зазвичай подаються як закуска або снек, часто разом із соусом для занурення, таким як соус солодкого чилі або нуок чам. Їх цінують за смачний смак і задовільну текстуру, що робить їх популярними.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1,2 кг свинячої грудинки\n" +
                        "1 ч. л. солі, трохи перцю\n" +
                        "120 г шинки (наприклад, вареної мальбунера)\n" +
                        "1 пучок нарізаного базиліка\n" +
                        "½ пучка подрібненого орегано\n" +
                        "½ пучка подрібненої петрушки \n" +
                        "3 подрібнені зубчики часнику\n" +
                        "1 чайна ложка дрібно змеленого насіння кропу\n" +
                        "8 шматків кухонного шпагату (приблизно 40 см кожен)\n" +
                        "1 ст.л. вершкового масла для смаження \n" +
                        "500 г моркви, розрізаної навпіл уздовж \n" +
                        "300 г нарізаної селери приблизно 2 см\n" +
                        "2 червоні цибулини\n" +
                        "2 столові ложки томатного пюре\n" +
                        "1 лавровий лист\n" +
                        "2 склянки червоного вина\n" +
                        "4 склянки телячого бульйону",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Наповнення м'яса: Покласти м'ясо із шкірою на дошку для різання, видаливши при необхідності кістки та хрящі. Розріжте його на дві частини завдовжки найбільшої сторони, не розрізаючи його до кінця, розкрийте. Посоліть м'ясо з обох сторін. Покладіть вишневу шинку зверху. Змішайте трави, часник і насіння фенхелю, посипте ними м'ясо. Зверніть м'ясо з короткого боку, утворюючи щільний рулон так, щоб шкіра була зовні. Проведіть мотузку під м'ясом і зав'яжіть м'ясо мотузками.\n" +
                        "Приготування на сковороді: Розтопіть вершкове масло в сковороді. Смажте м'ясо з усіх боків на середньому вогні протягом 8 хвилин, потім переложіть його в каструлю. Додайте моркву та яблуко селери.\n" +
                        "Приготування в духовці: Приблизний час приготування - приблизно 45 хвилин у нижній частині попередньо розігрітого духовки до 180°C. Вийміть каструлю з духовки, підвищте температуру до 200°C.\n" +
                        "Для соусу: Смажте цибулю у залишеній сковороді з томатами і лавровим листом протягом приблизно 10 хвилин, помішуючи час від часу. Додайте вино та бульйон, доведіть до кипіння і варіть протягом приблизно 15 хвилин. Злейте соус на м'ясо в каструлю. Помістіть каструлю в нижню частину холодної духовки.\n" +
                        "Завершення приготування: Готуйте приблизно 5 хвилин, вийміть з духовки, зніміть кулінарну мотузку. Наріжте м'ясо на шматочки і приправте овочами та соусом.\n" +
                        "Подавайте з: полентою.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 51,
            categoryOfFood = "Супи",
            dishTitle = "Мінестроне",
            imageResId = R.drawable.minestrone_51,
            description =
            "Мінестроне - це ситний італійський овочевий суп, зазвичай вегетаріанський і нежирний, що робить його гарним вибором для тих, хто дотримується дієтичних обмежень. Це густий суп з різноманітними овочами, квасолею та макаронами або рисом. В середньому одна порція мінестроне містить близько 150-200 калорій. Мінестроне - це універсальний італійський суп, до складу якого входять сезонні овочі, квасоля, часто макарони або рис. Він приправлений ароматними травами та ідеально вариться в пікантному бульйоні. Рецепт розрахований приблизно на 6 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 столові ложки оливкової олії\n" +
                        "1 цибуля, нарізана\n" +
                        "2 моркви, нарізані кубиками\n" +
                        "2 селери, нарізані кубиками\n" +
                        "2 зубчики часнику, подрібнені\n" +
                        "1 кабачок, нарізаний кубиками\n" +
                        "1 жовта кабачка, нарізана кубиками\n" +
                        "1 банка (14 унцій) нарізаних помідорів\n" +
                        "6 чашок овочевого бульйону\n" +
                        "1 банка (15 унцій) кінді бобів, злитих і промитих\n" +
                        "1 чашка маленьких макаронів або рису\n" +
                        "1 чайна ложка сушеного базиліку\n" +
                        "1 чайна ложка сушеного орегано\n" +
                        "Сіль і перець за смаком\n" +
                        "Тертий сир Пармезан для подачі (за бажанням)"
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій каструлі розігріти оливкову олію на середньому вогні.\n" +
                        "Додати нарізану цибулю, моркву, селеру та часник. Обсмажити до розм'якшення.\n" +
                        "Додати цукіні, жовті патисони та нарізані кубиками помідори. Готуємо ще кілька хвилин.\n" +
                        "Вливаємо овочевий бульйон і доводимо до кипіння.\n" +
                        "Додати квасолю, макарони або рис, сушений базилік, сушений орегано, сіль і перець.\n" +
                        "Зменшити вогонь, накрити кришкою і тушкувати 15-20 хвилин або поки овочі не стануть м'якими.\n" +
                        "Подавати гарячим, за бажанням прикрасивши тертим пармезаном.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 52,
            categoryOfFood = "Супи",
            dishTitle = "Тосканський суп",
            imageResId = R.drawable.toskanskyj_sup_52,
            description =
            "Тосканський суп - це вершковий італійський суп з насиченим і заспокійливим смаком. Хоча він не підходить для вегетаріанців через використання ковбаси, він не має особливих дієтичних обмежень. Одна порція Тосканського супа зазвичай містить близько 250-300 калорій. Тосканський суп - це ситний суп з італійською ковбасою, картоплею, капустою та вершковим бульйоном з ноткою гостроти від пластівців червоного перцю. Це смачна та зігріваюча страва, яка ідеально підходить для прохолодних днів. Рецепти розраховані на різні порції, від однієї до великої каструлі для сімейного обіду.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Італійська ковбаса (м'яка або гостра)\n" +
                        "Цибуля ріпчаста\n" +
                        "Часник\n" +
                        "Курячий бульйон\n" +
                        "Картопля\n" +
                        "Червоний перець пластівці\n" +
                        "Капуста\n" +
                        "Жирні вершки\n" +
                        "Сіль і перець\n" +
                        "Оливкова олія\n" +
                        "Сир пармезан (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Зварити італійську ковбасу у великій каструлі, розламавши її на шматочки. Вийняти і відкласти в сторону.\n" +
                        "У тій же каструлі пасеруємо цибулю та часник до напівпрозорості.\n" +
                        "Додаємо курячий бульйон і доводимо до кипіння.\n" +
                        "Додаємо нарізану картоплю та пластівці червоного перцю. Варити, поки картопля не стане м'якою.\n" +
                        "Всипати нарізану капусту і варити до зів'янення.\n" +
                        "Повертаємо в каструлю варену ковбасу.\n" +
                        "Вливаємо жирні вершки і тушкуємо до повного загустіння.\n" +
                        "Посолити та поперчити за смаком.\n" +
                        "Подавати гарячим, за бажанням прикрасивши сиром пармезан."
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 53,
            categoryOfFood = "Супи",
            dishTitle = "Чоппіно",
            imageResId = R.drawable.choppino_53,
            description =
            "Чоппіно - це італійське рагу з морепродуктів, чудова страва без особливих дієтичних обмежень. Це рагу на основі томатів з різними морепродуктами, такими як креветки, краби та риба, яке зазвичай подається з хрустким хлібом. Порція містить близько 350-450 калорій. Чоппіно - це ароматне рагу з морепродуктів на основі томатів і наваристого бульйону. До нього додають різноманітні морепродукти, часто креветки, краби, молюски, мідії та рибу, приправляють зеленню і подають з хрустким хлібом. Наведені рецепти розраховані на 46 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Оливкова олія\n" +
                        "Цибуля\n" +
                        "Часник\n" +
                        "Пластівці червоного перцю\n" +
                        "Подрібнені помідори\n" +
                        "Біле вино\n" +
                        "Рибний бульйон або бульйон з морепродуктів\n" +
                        "Лаврове листя\n" +
                        "Свіжа зелень (наприклад, базилік, петрушка)\n" +
                        "Асорті з морепродуктів (креветки, краби, молюски, мідії, риба)\n" +
                        "Сіль і перець\n" +
                        "Хліб з хрусткою скоринкою (для подачі)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій каструлі обсмажте на оливковій олії цибулю, часник і пластівці червоного перцю.\n" +
                        "Додати подрібнені помідори, біле вино, рибний або морепродуктовий бульйон і лавровий лист. Тушкуємо на повільному вогні.\n" +
                        "Додайте морепродукти, починаючи з товстих шматків і закінчуючи делікатними, такими як креветки.\n" +
                        "Варити до готовності морепродуктів (креветки стануть рожевими, молюски та мідії розкриються).\n" +
                        "Приправити свіжою зеленню, сіллю та перцем.\n" +
                        "Подавати гарячим з хрустким хлібом, щоб ввібрати смачний бульйон.\n" +
                        "Будь ласка, зверніться до наданих джерел рецептів за детальними інструкціями та насолоджуйтеся цим італійським делікатесом з морепродуктів!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 54,
            categoryOfFood = "Супи",
            dishTitle = "Риболліта",
            imageResId = R.drawable.rybollitto_54,
            description =
            "Риболліта - це ситний тосканський суп родом з Італії. До його складу зазвичай входять овочі, квасоля та хліб, що робить його вегетаріанським. Порція містить приблизно 250-350 калорій.  Риболліта - густий, ароматний суп з квасолею каннелліні, капустою, морквою та помідорами. Його загущують шматочками хліба і часто приправляють часником та ароматними травами. Більшість рецептів розраховані на 68 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Оливкова олія\n" +
                        "Цибуля\n" +
                        "Морква\n" +
                        "Селера\n" +
                        "Часник\n" +
                        "Капуста або капуста\n" +
                        "Квасоля каннеліні\n" +
                        "Подрібнені помідори\n" +
                        "Хліб\n" +
                        "Бульйон або вода\n" +
                        "Сіль і перець\n" +
                        "Трави (наприклад, розмарин, чебрець)\n" +
                        "Тертий пармезан (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Обсмажте цибулю, моркву, селеру та часник на оливковій олії.\n" +
                        "Додайте капусту і готуйте, поки вона не зів'яне.\n" +
                        "Додайте подрібнені помідори, квасолю каннеліні та зелень.\n" +
                        "Додайте шматочки хліба та бульйон або воду.\n" +
                        "Тушкувати, доки хліб не розчиниться, утворюючи густу консистенцію.\n" +
                        "Посолити, поперчити, за бажанням прикрасити тертим пармезаном і подавати гарячим.\n" +
                        "Зверніться до наданих джерел рецептів за детальними інструкціями та насолоджуйтеся цим затишним італійським супом!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 55,
            categoryOfFood = "Супи",
            dishTitle = "Каччуко",
            imageResId = R.drawable.caccukko_55,
            description =
            "Каччуко - це наваристе італійське рагу з морепродуктів родом з Ліворно, Тоскана. Ця ароматна страва зазвичай включає різноманітні види риби та молюсків, такі як кальмари, восьминоги, креветки та різні види риби, тушковані в томатному бульйоні з часником, пластівцями червоного перцю та травами. Це ситна і сільська страва, яка ідеально підходить для любителів морепродуктів. Через вміст морепродуктів каччуко не підходить для вегетаріанців та людей з алергією на молюсків. Кількість калорій може варіюватися залежно від конкретних інгредієнтів, але зазвичай становить від 300 до 500 калорій на порцію. Каччуко - це рагу з морепродуктів, відоме своїм насиченим і пікантним смаком. Більшість рецептів розраховані на 4-6 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Суміш свіжих морепродуктів (наприклад, кальмари, восьминоги, креветки, рибне філе)\n" +
                        "Оливкова олія\n" +
                        "Часник\n" +
                        "Пластівці червоного перцю\n" +
                        "Біле вино\n" +
                        "Консервовані помідори\n" +
                        "Свіжа зелень (наприклад, петрушка та базилік)\n" +
                        "Шматочки хліба\n",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій каструлі розігріти оливкову олію, додати подрібнений часник і пластівці червоного перцю для гостроти.\n" +
                        "Додайте біле вино і дайте йому покипіти, щоб уваритися.\n" +
                        "Додайте консервовані помідори та воду і варіть на повільному вогні, щоб утворилася основа.\n" +
                        "Додайте морепродукти, починаючи з тих, що готуються найповільніше.\n" +
                        "Тушкувати до повної готовності морепродуктів.\n" +
                        "Подавати в тарілках, поклавши на дно скибочки хліба.\n" +
                        "Вилийте тушковане м'ясо на хліб, щоб воно ввібрало в себе смачні аромати.\n" +
                        "Прикрасьте свіжою зеленню і полийте оливковою олією.\n" +
                        "Подавайте гарячим і насолоджуйтеся цією чудовою італійською стравою з морепродуктів!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 56,
            categoryOfFood = "Супи",
            dishTitle = "Рулька по-римски",
            imageResId = R.drawable.trippa_alla_romana_56,
            description =
            "Рулька по-римски (Trippa alla Romana) - класична римська страва з рульки (яловичого шлунка), приготована в томатному соусі з м'ятою та сиром Пекоріно. Це ситна та ароматна страва, традиційно римська. Рулька по-римски (Trippa alla Romana) не підходить для вегетаріанців або тих, хто не вживає продукти з яловичини. Кількість калорій може варіюватися, як правило, близько 200-300 калорій на порцію. Рулька по-римски (Trippa alla Romana) - це страва з рульки в римському стилі, відома своїми унікальними смаковими якостями. Більшість рецептів розраховані на 4-6 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Рубець (яловичий шлунок)\n" +
                        "Оливкова олія\n" +
                        "Цибуля\n" +
                        "Томатний соус\n" +
                        "Свіже листя м'яти\n" +
                        "Сир Пекоріно\n" +
                        "Сіль і перець",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Почистити та бланшувати потруху, потім нарізати її невеликими шматочками.\n" +
                        "На сковороді обсмажити дрібно нарізану цибулю на оливковій олії до напівпрозорості.\n" +
                        "Додаємо вирізку і смажимо, поки не підрум'яниться.\n" +
                        "Вливаємо томатний соус, додаємо подрібнену м'яту, сіль та перець.\n" +
                        "Тушкувати приблизно від 45 хвилин до години, періодично помішуючи.\n" +
                        "Подавати гарячим, прикрасивши сиром Пекоріно та додатковими листочками м'яти.\n" +
                        "Насолоджуйтесь цим римським делікатесом з його неповторним смаком!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 57,
            categoryOfFood = "Супи",
            dishTitle = " Суп  з помідорів - Паппа аль памодоро",
            imageResId = R.drawable.sup_z_pomodoriv_57,
            description =
            "Суп з помідорів (Pappa al Pomodoro) - класичний тосканський суп з помідорами та хлібом, насичений смаком і глибоко заспокійливий. Він підходить для вегетаріанців і є різновидом італійського хлібного супу. Приблизно 200-300 калорій на порцію, залежно від розміру порції та інгредієнтів. Суп з помідорів (Pappa al Pomodoro) - густий суп, приготований з простих інгредієнтів: помідорів, черствого хліба, оливкової олії, часнику та свіжого базиліка. Це ситна страва, яка перетворює хліб на заспокійливу томатну насолоду. Більшість рецептів розраховані на 4-х осіб.",
            ingredients = listOf(
                "Інгредієнти\n" ,
                        "500 г стиглих помідорів (очищених і нарізаних)\n" +
                        "250 г черствого тосканського або заквашеного хліба\n" +
                        "2 зубчики часнику\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія першого віджиму\n" +
                        "Сіль і перець\n" +
                        "Овочевий бульйон (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У каструлі розігріти оливкову олію та обсмажити подрібнений часник до появи аромату.\n" +
                        "Додати помідори, посолити, поперчити та розірвані листочки базиліку.\n" +
                        "Тушкувати, поки помідори не перетворяться на соус.\n" +
                        "Черствий хліб розламати на маленькі шматочки і додати в каструлю.\n" +
                        "Якщо суміш занадто густа, додаємо овочевий бульйон.\n" +
                        "Добре перемішати і дати покипіти, поки хліб не вбере в себе томатний соус.\n" +
                        "Подавайте теплим, прикрасивши свіжим базиліком і скропивши оливковою олією.\n" +
                        "Насолоджуйтесь цією смачною та заспокійливою тосканською класикою!\n",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 58,
            categoryOfFood = "Супи",
            dishTitle = "Суп із сочевиці",
            imageResId = R.drawable.sup_iz_sochevytsi_58,
            description =
            "Сочевичний суп (Zuppa di Lenticchie) - поживний і ситний італійський суп. Зазвичай він містить зелену або коричневу сочевицю, овочі, такі як морква і селера, цибуля, часник, а іноді нарізані кубиками помідори. Суп приправляють травами, такими як лавровий лист і чебрець, і часто подають з краплею оливкової олії та тертим сиром пармезан. Хоча він зазвичай не асоціюється з дієтичними обмеженнями, ви повинні підбирати інгредієнти відповідно до своїх дієтичних потреб.  Приблизно 200-300 калорій на порцію, залежно від розміру порції та інгредієнтів.  Більшість рецептів розраховані на 46 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 склянка зеленої або коричневої сочевиці\n" +
                        "1 цибулина, подрібнена\n" +
                        "2 зубчики часнику, подрібнені\n" +
                        "2 моркви, нарізані кубиками\n" +
                        "2 стебла селери, нарізані кубиками\n" +
                        "1 банка нарізаних кубиками помідорів (за бажанням)\n" +
                        "1 лавровий лист\n" +
                        "1 чайна ложка сушеного чебрецю\n" +
                        "Сіль і перець за смаком\n" +
                        "Оливкова олія для збризкування\n" +
                        "Тертий пармезан для подачі",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Сочевицю промити та відцідити.\n" +
                        "У великій каструлі розігріти оливкову олію і обсмажити цибулю, часник, моркву та селеру до розм'якшення.\n" +
                        "Додайте сочевицю, лавровий лист, чебрець і нарізані кубиками помідори (якщо використовуєте).\n" +
                        "Влийте достатньо води, щоб покрити інгредієнти, і доведіть до кипіння.\n" +
                        "Зменшити вогонь, накрити кришкою і варити приблизно 30-40 хвилин, або поки сочевиця не стане м'якою.\n" +
                        "Посолити та поперчити.\n" +
                        "Подавати гарячою, полив оливковою олією та посипавши тертим пармезаном.\n" +
                        "Зверніть увагу, що за конкретним рецептом італійського супу з сочевиці ви можете звернутися до італійських кулінарних сайтів або кулінарних книг.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 60,
            categoryOfFood = "Піца",
            dishTitle = "Маргарита Піца",
            imageResId = R.drawable.ol_margherita_pizza_40,
            description =
            "Піца \"Маргарита\" - класична італійська піца, відома своєю простотою та вишуканим смаком. Вона має тонкий корж, увінчаний свіжими інгредієнтами. Для піци \"Маргарита\" немає особливих дієтичних обмежень.  Піца \"Маргарита\" складається з тонкого коржа, змащеного томатним соусом, свіжого сиру моцарела, листя свіжого базиліка, оливкової олії та дрібки солі. Це чудове поєднання смаків, з базиліком, що надає свіжого аромату. Приблизно 250-300 калорій на шматок (залежно від товщини скоринки та кількості сиру). Більшість рецептів піци \"Маргарита\" розраховані на приготування одного шматка розміром 12 дюймів, який зазвичай обслуговує 24 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 тісто для піци (магазинне або домашнє)\n" +
                        "1/2 склянки томатного соусу або подрібнених помідорів\n" +
                        "8 унцій свіжого сиру моцарела, нарізаного скибочками\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія\n" +
                        "Сіль",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури (зазвичай близько 500°F або 260°C).\n" +
                        "Розкачайте тісто для піци на присипаній борошном поверхні до бажаної товщини.\n" +
                        "Перенесіть тісто на піцца-камінь або пекарський лист.\n" +
                        "Рівномірно розподіліть томатний соус по тісту, залишивши бордюр по краях для скоринки.\n" +
                        "Викладіть скибочки свіжого сиру моцарела поверх соусу.\n" +
                        "Порвіть листя свіжого базиліка і розкладіть їх по піці.\n" +
                        "Збризніть піцу оливковою олією та посипте дрібкою солі.\n" +
                        "Випікайте в попередньо розігрітій духовці приблизно 1012 хвилин або поки скоринка не стане золотистою, а сир не стане пухирчастим.\n" +
                        "Вийміть з духовки, дайте трохи охолонути, наріжте і подавайте гарячим. Насолоджуйтесь домашньою піцою Маргарита!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 61,
            categoryOfFood = "Піца",
            dishTitle = "Піца Чотири сири",
            imageResId = R.drawable.pizza_chotyry_syry_61_small,
            description =
            "\"Кватро Формаджі\", або \"Чотири сири\" - це чудова італійська піца з начинкою з комбінації чотирьох сирів. Ця страва не має особливих дієтичних обмежень, якщо у вас немає алергії на сир або непереносимості лактози. Тонкий корж піци \"Кватро формаджі\" щедро вкритий сумішшю з чотирьох видів сиру: моцарелли, горгонзоли, пармезану та проволоне. В результаті виходить насичена, сирна та ароматна піца. Типовий шматок піци кватро-формаджі містить близько 250350 калорій, залежно від розміру та товщини скоринки. За більшістю рецептів готується одна 12-дюймова піца, яка розрахована на 24 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 піцца-тісто (готове або власноруч приготоване)\n" +
                        "1/2 чашки моцарели, тертої\n" +
                        "1/4 чашки горгонзоли, дрібно подрібненої\n" +
                        "1/4 чашки пармезану, тертого\n" +
                        "1/4 чашки проволоне, тертої",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Перед нагрійте вашу піч до найвищої температури (зазвичай близько 500°F або 260°C).\n" +
                        "Розкатайте піцца-тісто на попередньо припудреній поверхні до бажаної товщини.\n" +
                        "Перенесіть тісто на піцца-камінь або пекарський лист.\n" +
                        "Рівномірно розподіліть моцарелу на тісто, залишаючи краї для корки.\n" +
                        "Додайте горгонзолу, пармезану і проволоне, розподіляючи їх рівномірно.\n" +
                        "Пекти в попередньо розігрітій печі протягом близько 10-12 хвилин або доки корка не стане золотистою, а сир не розтане і не підскочить.\n" +
                        "Вийміть з печі, дайте трохи охолонути, наріжте і насолоджуйтесь своєю смачною домашньою піццею \"Кватро Формаджi\"!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 62,
            categoryOfFood = "Піца",
            dishTitle = "Піца Неаполітанська",
            imageResId = R.drawable.ol_pizza_napoletana_42,
            description =
            "Піца Наполетана, або неаполітанська піца, - це класична італійська піца, відома своєю тонкою, м'якою і злегка жувальною скоринкою. Зазвичай вона складається з простих інгредієнтів, таких як помідори Сан-Марцано, сир моцарела, базилік, оливкова олія та сіль. Ця страва не має особливих дієтичних обмежень, якщо у вас немає алергії на ці інгредієнти.   Неаполітанська піца має тонку скоринку, м'яку, повітряну середину та злегка хрустку скоринку зовні. Вона відома своєю простотою, з акцентом на високоякісні інгредієнти.  Типова неаполітанська піца містить близько 200300 калорій на шматок, що може змінюватися залежно від начинки та розміру піци.  Більшість рецептів передбачає приготування однієї 12-дюймової піци, яка розрахована на 2-4 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (магазинне або домашнє)\n" +
                        "Помідори Сан Марцано або томатний соус\n" +
                        "Свіжий сир моцарела\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія першого віджиму\n" +
                        "Сіль",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте камінь для піци або духовку до найвищої температури (зазвичай близько 500°F або 260°C).\n" +
                        "Розкачайте тісто для піци на присипаній борошном поверхні до бажаної товщини.\n" +
                        "Перекладіть тісто на форму для піци або деко, присипане кукурудзяним борошном.\n" +
                        "Викладаємо на тісто тонкий шар томатного соусу.\n" +
                        "Додайте шматочки свіжої моцарели та листя свіжого базиліка.\n" +
                        "Збризніть оливковою олією та посипте дрібкою солі.\n" +
                        "Обережно перекладіть піцу в гарячу духовку або на камінь для піци.\n" +
                        "Випікайте приблизно від 90 секунд до 2 хвилин, поки скоринка не підрум'яниться і не обвуглиться.\n" +
                        "Дістаньте з духовки, дайте трохи охолонути, наріжте і насолоджуйтеся справжньою неаполітанською піцою!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 63,
            categoryOfFood = "Піца",
            dishTitle = "Кальцоне",
            imageResId = R.drawable.ol_calzone_43,
            description =
            "Кальцоне - смачна італійська страва зі складеним удвічі тістом для піци з начинкою з різних інгредієнтів, схожа на перевертень. Для кальцоне немає особливих дієтичних обмежень, але інгредієнти можуть варіюватися. В середньому кальцоне містить близько 500700 калорій на порцію. Кальцоне - це кишеньки з тіста, наповнені сиром, томатним соусом, овочами та м'ясом. Зазвичай їх складають у формі півмісяця і випікають до золотистої скоринки. У більшості рецептів виходить 24 кальцоне, залежно від того, який розмір ви віддаєте перевагу.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (магазинне або домашнє)\n" +
                        "Томатний соус або маринара\n" +
                        "Сир моцарела\n" +
                        "Начинка на ваш вибір (наприклад, пепероні, ковбаса, овочі)\n" +
                        "Оливкова олія (для змащування)\n" +
                        "Сіль і перець (за смаком)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 475°F (245°C) або відповідно до рецепту.\n" +
                        "Розділіть тісто для піци на рівні частини.\n" +
                        "Розкачайте кожну частину в коло або овал на присипаній борошном поверхні.\n" +
                        "Нанесіть шар томатного соусу на одну половину кожного кола тіста.\n" +
                        "Додайте бажану начинку, залишаючи трохи місця по краях.\n" +
                        "Складіть другу половину тіста поверх начинки, створюючи форму півмісяця.\n" +
                        "Щільно притисніть краї, щоб запечатати.\n" +
                        "Змастіть верхівки кальцоне оливковою олією, посоліть і поперчіть.\n" +
                        "Викласти кальцоне на деко або камінь для піци.\n" +
                        "Випікати в попередньо розігрітій духовці приблизно 1215 хвилин або до золотистої скоринки.\n" +
                        "Вийміть з духовки, дайте їм трохи охолонути і насолоджуйтеся свіжоспеченими кальцоне!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 64,
            categoryOfFood = "Піца",
            dishTitle = "Біла піца або Піца Б'янка.",
            imageResId = R.drawable.ol_pizza_bianca_44,
            description =
            "Піца Б'янка, або Біла піца - це італійська піца, відома своєю простотою. Зазвичай вона не містить томатного соусу і поєднує в собі вершкові сири, часник і зелень. Особливих дієтичних обмежень немає. В середньому шматок білої піци містить близько 250-300 калорій. Піца Б'янка - це піца без томатного соусу, до складу якої входять такі інгредієнти, як моцарела, рікотта, пармезан, часник, оливкова олія та свіжа зелень. Вона відома своїм насиченим вершковим смаком. За більшістю рецептів готується 1 велика піца або 2 менші, розраховані на 2-4 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (магазинне або домашнє)\n" +
                        "Оливкова олія\n" +
                        "Часниковий фарш\n" +
                        "Сир моцарела\n" +
                        "Сир рікотта\n" +
                        "Сир пармезан\n" +
                        "Свіжі трави (наприклад, базилік, орегано)\n" +
                        "Сіль і перець",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до рекомендованої температури (зазвичай близько 475°F або 245°C).\n" +
                        "Розкачайте тісто для піци на присипаній борошном поверхні до бажаної товщини.\n" +
                        "Перекладіть тісто на деко або камінь для піци.\n" +
                        "Змастіть тісто оливковою олією та подрібненим часником.\n" +
                        "Рівномірно посипте тісто сиром моцарела.\n" +
                        "Додаємо кусочки сиру рікотта та тертий пармезан.\n" +
                        "Посолити, поперчити та посипати свіжими травами.\n" +
                        "Випікати в розігрітій духовці 1012 хвилин або поки скоринка не стане золотистою, а сир - пухирчастим і злегка підрум'яненим.\n" +
                        "Дістаньте з духовки, дайте охолонути, наріжте і насолоджуйтеся смачною піцою Б'янка!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 65,
            categoryOfFood = "Піца",
            dishTitle = "Сицилійська піца",
            imageResId = R.drawable.ol_sicilian_pizza_45,
            description =
            "Сицилійська піца - це товста, прямокутна піца з хрусткою скоринкою, що характеризується пишною внутрішньою частиною. Вона не має особливих дієтичних обмежень, якщо тільки у вас немає особливих уподобань щодо інгредієнтів. Зазвичай до складу піци входить сир, томатний соус і різноманітні начинки. Одна порція сицилійської піци містить приблизно 285300 калорій. Сицилійська піца відома своєю товстою, повітряною скоринкою, хрусткою зовні і м'якою всередині. Зазвичай її прикрашають томатним соусом, сиром моцарела та начинками, такими як пепероні або овочі. За більшістю рецептів виходить піца розміром 12x18 дюймів, що розрахована на 6-8 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (домашнє або магазинне)\n" +
                        "Оливкова олія\n" +
                        "Томатний соус\n" +
                        "Сир моцарела\n" +
                        "Начинка на ваш вибір (наприклад, пепероні, болгарський перець, цибуля)\n" +
                        "Сіль і перець\n" +
                        "Свіжий базилік (за бажанням)\n" +
                        "Тертий пармезан (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 475°F (245°C).\n" +
                        "Змастіть деко або прямокутну форму для піци оливковою олією.\n" +
                        "Тісто для піци рівномірно розтягнути і втиснути у форму, щоб воно доходило до країв.\n" +
                        "Змастіть тісто оливковою олією.\n" +
                        "Викладаємо на тісто шар томатного соусу.\n" +
                        "Додайте щедрий шар сиру моцарела.\n" +
                        "Рівномірно викласти обрану вами начинку.\n" +
                        "Посоліть та поперчіть.\n" +
                        "Випікайте в духовці 1520 хвилин або поки скоринка не стане золотистою, а сир не пузириться.\n" +
                        "За бажанням: Перед подачею прикрасьте свіжим базиліком і тертим пармезаном. Нарізати і насолоджуватися сицилійською піцою!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 66,
            categoryOfFood = "Піца",
            dishTitle = "Фокачча",
            imageResId = R.drawable.ol_focaccia_46,
            description =
            "Фокачча - це універсальний італійський коржик, який часто приправляють зеленню та оливковою олією. Не має особливих дієтичних обмежень. Це м'який, жувальний хліб, ідеально підходить для вмочування в оливкову олію або як гарнір. Одна порція зазвичай містить близько 100120 калорій. Фокачча - це ароматний, багатий на оливкову олію хліб, здобрений зеленню, іноді овочами або навіть сиром. Це простий, але смачний хліб, яким можна насолоджуватися різними способами. У більшості рецептів виходить стандартна прямокутна фокача, яку можна нарізати на 8-12 порцій.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 1/4 ч.л. активних сухих дріжджів\n" +
                        "1 ч.л. цукру\n" +
                        "1 склянка теплої води\n" +
                        "3 склянки борошна грубого помелу\n" +
                        "1 1/4 ч.л. солі\n" +
                        "1/4 склянки оливкової олії першого віджиму\n" +
                        "Свіжі або сушені трави (наприклад, розмарин, чебрець)\n" +
                        "Крупна сіль\n" +
                        "Додаткові інгредієнти (наприклад, помідори черрі, оливки)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У мисці змішайте дріжджі, цукор і теплу воду. Дати постояти близько 5 хвилин до утворення піни.\n" +
                        "Додайте до дріжджової суміші борошно та сіль. Перемішати до утворення тіста.\n" +
                        "Вимішувати тісто на присипаній борошном поверхні близько 5 хвилин.\n" +
                        "Покладіть тісто в змащену маслом миску, накрийте і залиште на 12 годин підніматися, поки воно не збільшиться вдвічі.\n" +
                        "Розігріти духовку до 425°F (220°C).\n" +
                        "Обминаємо тісто і викладаємо його у змащену олією форму для випікання.\n" +
                        "Накрийте його тканиною і залиште на 20-30 хвилин.\n" +
                        "Пальцями зробіть ямочки на поверхні тіста.\n" +
                        "Збризніть оливковою олією, посипте зеленню та крупною сіллю.\n" +
                        "За бажанням додайте додаткову начинку.\n" +
                        "Випікайте 20-25 хвилин до золотистої скоринки.\n" +
                        "Наріжте та подавайте до столу!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 67,
            categoryOfFood = "Піца",
            dishTitle = "Піца Марінара",
            imageResId = R.drawable.ol_pizza_marinara_47,
            description =
            "Піца Марінара - класична італійська піца, відома своєю простотою та насиченим смаком. Вона підходить для вегетаріанців і зазвичай не має дієтичних обмежень. Ця піца має тонкий корж з томатним соусом, часником, орегано та оливковою олією. Одна порція містить приблизно 150200 калорій. Піца Марінара - італійська піца, відома своїм мінімалістичним підходом. Вона складається з тонкого коржа, прикрашеного яскравим томатним соусом, ароматним часником, запашним орегано та краплиною оливкової олії. За більшістю рецептів виходить одна піца, яку можна розрізати на 2-4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (магазинне або домашнє)\n" +
                        "Томатний соус\n" +
                        "Свіжі зубчики часнику\n" +
                        "Сушений орегано\n" +
                        "Оливкова олія першого віджиму\n" +
                        "Сіль і перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури, яку вона може досягти (зазвичай близько 500°F або 260°C). Помістіть піцца-камінь або пекарський лист у духовку для нагрівання.\n" +
                        "На присипаній борошном поверхні розкачайте тісто для піци в тонку круглу форму.\n" +
                        "Перекладіть тісто на пергаментний папір, щоб його було легше перенести в гарячу духовку.\n" +
                        "Рівномірно розподіліть тонкий шар томатного соусу по тісту, залишаючи невеликий бордюр по краях.\n" +
                        "Подрібнюємо зубчики часнику та розподіляємо їх поверх соусу.\n" +
                        "Щедро посипаємо піцу сушеним орегано.\n" +
                        "Збризніть зверху оливковою олією першого віджиму.\n" +
                        "Посоліть і поперчіть за смаком.\n" +
                        "Обережно покладіть пергаментний папір з піцою на гарячий камінь для випікання або деко.\n" +
                        "Випікайте приблизно 10-12 хвилин, поки скоринка не стане хрусткою, а краї злегка золотистими.\n" +
                        "Вийміть з духовки, дайте трохи охолонути, наріжте і насолоджуйтеся смачною піцою Марінара!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 68,
            categoryOfFood = "Піца",
            dishTitle = "Піца б'янка з лимоном",
            imageResId = R.drawable.ol_pizza_bianca_with_lemon_91,
            description =
            "Піца Б'янка з лимоном - це чудова варіація традиційної піци, яка пропонує свіжий та пікантний смак. Ця піца характеризується білою основою, яку зазвичай готують з вершковим сиром рікотта або моцарелою, і прикрашається пікантною яскравістю лимона. Лимонна цедра і сік надають піці цитрусового аромату, який чудово доповнює насиченість сиру. Начинка може включати такі інгредієнти, як фісташково-лимонний песто, зелень, а іноді навіть рукколу для пікантного смаку. В результаті виходить гармонійне поєднання вершкових, сирних і цитрусових ноток, які створюють унікальний і апетитний смак піци, ідеальний для тих, хто шукає нові та захоплюючі смаки у світі піци.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        " 500 г борошна для піци\n" +
                        "2 чайні ложки солі\n" +
                        "кубик дріжджів (близько 10 г), подрібнених\n" +
                        "3 склянки води\n" +
                        "2 столові ложки оливкової олії\n" +
                        "3 столові ложки борошна для піци\n" +
                        "150 г нарізаної моцарели\n" +
                        "220 г сиру з блакитними прожилками (наприклад, горгонзола), подрібненого\n" +
                        "1 органічний лимон розрізати навпіл, а потім тонко нарізати\n" +
                        "½ чайної ложки пластівців чилі",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Тісто для піци: змішати борошно, сіль і дріжджі. " +
                        "Додайте воду та оливкову олію і вимішуйте приблизно 10 хвилин, поки тісто не стане м'яким і гладким. тісто. " +
                        "Накрити і залишити підніматися приблизно на 1 годину при кімнатній температурі, поки тісто не збільшиться в об'ємі вдвічі. в об'ємі.\n" +
                        "2. Начинка: поставте деко в холодну духовку і розігрійте її до 240°C. " +
                        "Розріжте тісто навпіл, сформуйте дві кульки, злегка приплюсніть їх рукою і розтягніть на невеликій кількості борошна, поки у вас не вийдуть тонкі диски з тіста. з тіста. " +
                        "Покладіть кожен з них на аркуш паперу для випічки. Викласти на диски тіста моцарелу, горгонзолу та лимон.\n" +
                        "3. Приготування: покласти одну з двох піц на гарячу плиту, не знімаючи папір для випікання. " +
                        "Випікати приблизно 20 хвилин у нижній частині попередньо розігрітої духовки. Дістати піцу з духовки і посипати половиною пластівців чилі. " +
                        "Негайно приготувати другу піцу такого ж типу",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 69,
            categoryOfFood = "Піца",
            dishTitle = "Піца маскарпоне з шинкою",
            imageResId = R.drawable.ol_pizza_with_mascarpone_and_ham_92,
            description =
            "Піца з маскарпоне та шинкою - це вишуканий делікатес, який поєднує в собі вершкову насиченість сиру маскарпоне та пікантну смакоту шинки. Ця піца, як правило, має тонкий хрусткий корж, на який наноситься шар соковитого сиру маскарпоне. Зверху щедро розкидані шматочки високоякісної шинки, найчастіше італійської або подібної до неї. Доповнюючими інгредієнтами можуть бути земляні гриби для додаткової глибини смаку. Коли піца випікається до досконалості, вона набуває чудового поєднання вершкового, солоного та умамі смаків. Це вишукана версія класичної піци, яка пропонує гармонійний баланс текстур і смаків, що робить її улюбленою серед тих, хто цінує вишукану італійську кухню.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        " 475 г білого борошна\n" +
                        "100 г манки з твердих сортів пшениці\n" +
                        "2 чайні ложки солі\n" +
                        "½ кубика дріжджів (близько 20 г), подрібнених\n" +
                        "3½ літра води\n" +
                        "3 столові ложки оливкової олії\n" +
                        "трохи манки з твердих сортів пшениці\n" +
                        "2 ст.л. томатного соку\n" +
                        "1 столова ложка оливкової олії\n" +
                        "1 зубчик часнику, роздавлений\n" +
                        "1 столова ложка подрібненого базиліка\n" +
                        "4 чайні ложки солі і трохи перцю\n" +
                        "300 г нарізаної моцарели\n" +
                        "150 г помідорів черрі, розрізаних навпіл\n" +
                        "150 г маскарпоне\n" +
                        "50 г нарізаної сирої шинки\n" +
                        "40 г руколи",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "1. Для тіста для піци: в мисці змішайте борошно, манку, сіль і дріжджі. Додайте воду та олію, перемішуйте близько 10 хвилин на мінімальній потужності кухонного комбайна до отримання м'якого та однорідного тіста. \n" +
                        "Викласти тісто. Накрити і залишити підніматися приблизно на 2 години при кімнатній температурі, поки тісто не збільшиться в об'ємі вдвічі.\n" +
                        "2. Начинка: розділити тісто навпіл, сформувати кульки, злегка приплюснути їх. Повільно обваляйте їх у манній крупі, щоб сформувати два диски (близько 30 см в діаметрі). Викласти кожну основу для піци на деко, застелене папером для випічки. Змішати томатний соус, олію, часник і базилік, приправити. Розподіліть соус по обох основах піци, залишаючи 1½ см від краю. Зверху викладіть моцарелу, помідори чері та маскарпоне.\n" +
                        "3. Готуємо: Готуйте приблизно 25 хвилин у нижній частині духовки, розігрітій до 240°C. Дістати піцу з духовки, \n" +
                        "викладіть на неї половину сирої шинки та руколи, приправте. Так само випікаємо і прикрашаємо другу піцу. Щоб тісто було більш хрустким, розігрійте деко в духовці або використовуйте камінь для піци.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 70,
            categoryOfFood = "Піца",
            dishTitle = "Піца Капріччоза",
            imageResId = R.drawable.ol_pizza_capricciosa_48,
            description =
            "Піца Капріччоза - чудова італійська піца. Зазвичай вона містить шинку, гриби, артишоки, томатний соус, сир моцарела, оливки, оливкову олію та базилік. Особливих дієтичних обмежень для цієї страви немає. Одна порція становить приблизно 250300 калорій. Піца Капріччоза - класична італійська піца, відома своєю збалансованою та ароматною начинкою. Вона поєднує в собі насиченість шинки та сиру із землянистістю грибів та артишоків, доповнену свіжістю оливок та базиліку. З більшості рецептів виходить одна піца, розрахована на 2-4 порції.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (магазинне або домашнє)\n" +
                        "Томатний соус\n" +
                        "Сир моцарела\n" +
                        "Шматочки шинки\n" +
                        "Консервовані серцевини артишоків, відціджені та нарізані\n" +
                        "Шампіньйони, тонко нарізані\n" +
                        "Маслини без кісточок, розрізані навпіл\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія\n" +
                        "Сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури, яку вона може досягти (зазвичай близько 500°F або 260°C). Помістіть в духовку камінь для піци або деко, щоб розігріти.\n" +
                        "На присипаній борошном поверхні розкачайте тісто для піци в тонку круглу форму.\n" +
                        "Перекладіть тісто на пергаментний папір, щоб його було легше перенести в гарячу духовку.\n" +
                        "Рівномірно розподілити тонкий шар томатного соусу по тісту, залишаючи невеликий бордюр по краях.\n" +
                        "Посипаємо соус сиром моцарела.\n" +
                        "Зверху викласти скибочки шинки, нарізані артишоки, скибочки грибів та половинки оливок.\n" +
                        "Посолити та поперчити за смаком.\n" +
                        "Обережно покладіть пергаментний папір з піцою на гарячий камінь для випікання або деко.\n" +
                        "Випікати приблизно 10-12 хвилин, доки скоринка не стане хрусткою, а сир - пухирчастим і золотистим.\n" +
                        "Дістаньте з духовки, посипте зверху свіжим листям базиліка, полийте оливковою олією, наріжте і насолоджуйтеся смачною піцою \"Капріччоза\"!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 71,
            categoryOfFood = "Піца",
            dishTitle = "Піца Диявола",
            imageResId = R.drawable.ol_pizza_diavola_49,
            description =
            "Піца Диавола - це італійська піца, відома своїми гострими смаками. Зазвичай до її складу входять томатний соус, сир моцарела, гостра салямі та іноді пластівці чилі. Особливих дієтичних обмежень немає. Кожна порція містить приблизно 250-300 калорій. Піца Диавола, що означає \"Диявольська піца\", містить пунш з гострою салямі та пластівцями чилі. Це ароматна і вогняна піца, яка врівноважує спеку з насиченістю сиру і томатного соусу. Більшість рецептів розраховані на 2-4 особи.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (магазинне або домашнє)\n" +
                        "Томатний соус\n" +
                        "Сир моцарела\n" +
                        "Гостра салямі або пепероні\n" +
                        "Пластівці чилі (за бажанням)\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури (зазвичай близько 500°F або 260°C), поставивши в неї камінь для піци або деко.\n" +
                        "На присипаній борошном поверхні розкачайте тісто для піци в тонку круглу форму.\n" +
                        "Перекладіть тісто на пергаментний папір, щоб його було легше перенести в гарячу духовку.\n" +
                        "Рівномірно розподіляємо тонкий шар томатного соусу по тісту, залишаючи невеликий бортик.\n" +
                        "Посипаємо соус сиром моцарела.\n" +
                        "Додаємо шматочки гострої салямі або пепероні.\n" +
                        "За бажанням можна посипати пластівцями чилі для додаткової гостроти.\n" +
                        "Посоліть і поперчіть.\n" +
                        "Обережно покладіть пергаментний папір з піцою на гарячий камінь для випікання або деко.\n" +
                        "Випікайте 10-12 хвилин, поки скоринка не стане хрусткою, а сир - золотистим.\n" +
                        "Дістаньте з духовки, наріжте і насолоджуйтеся пікантною піцою Диавола!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 72,
            categoryOfFood = "Піца",
            dishTitle = "Піца Пепероні",
            imageResId = R.drawable.ol_pizza_pepperoni_76,
            description =
            "Піца Пепероні - улюблена класика з хрусткою скоринкою, пікантним томатним соусом, ніжним сиром моцарела та гострим пепероні. ",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци\n" +
                        "1/2 склянки томатного соусу\n" +
                        "1 1/2 склянки подрібненого сиру моцарела\n" +
                        "3,5 унції (приблизно 24 скибочки) пепероні\n" +
                        "1 столова ложка оливкової олії",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 475°F (245°C).\n" +
                        "Розкачати тісто для піци на присипаній борошном поверхні.\n" +
                        "Перекласти тісто на камінь для піци або деко.\n" +
                        "Рівномірно розподіліть томатний соус по тісту.\n" +
                        "Щедро посипати сиром моцарела.\n" +
                        "Розкласти скибочки пепероні поверх сиру.\n" +
                        "Збризнути зверху оливковою олією.\n" +
                        "Випікайте 12-15 хвилин, поки скоринка не стане золотистою, а сир не пузириться.\n" +
                        "Наріжте і насолоджуйтеся домашньою піцою пепероні.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 73,
            categoryOfFood = "Піца",
            dishTitle = "Піца Прошутто з грибами",
            imageResId = R.drawable.pizza_prosciutto_e_funghi_77,
            description =
            "Піца \"Прошутто е фунгі\" - смачна італійська піца з пікантним прошутто та пікантними грибами.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци\n" +
                        "1/2 склянки томатного соусу\n" +
                        "1 1/2 склянки сиру моцарела\n" +
                        "4-6 скибочок прошутто\n" +
                        "1 склянка нарізаних грибів\n" +
                        "Оливкова олія\n" +
                        "Свіже листя базиліка (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 475°F (245°C).\n" +
                        "Розкатайте тісто для піци на посипаній борошном поверхні.\n" +
                        "Перенесіть тісто на піцца-камінь або пекарський лист.\n" +
                        "Розподіліть тонкий шар томатного соусу на тісті.\n" +
                        "Рівномірно посипте сиром моцарела.\n" +
                        "Розподіліть кілька ломтиків прошутто і грибів.\n" +
                        "Полийте оливковою олією по начинці.\n" +
                        "Пекти протягом 12-15 хвилин або до золотистої корки і пузирчастого сиру.\n" +
                        "Прикрасьте свіжим базиліком за бажанням.\n" +
                        "Наріжте і насолоджуйтесь цією ароматною піццею \"Прошутто е Фунгі\".",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 74,
            categoryOfFood = "Піца",
            dishTitle = "Піца Маргарита з буффала моцареллою",
            imageResId = R.drawable.pizza_margherita_con_bufala_78,
            description =
            "Піца Маргарита з буфалою - це класична італійська піца, яка поєднує в собі простоту та насиченість.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци\n" +
                        "1/2 склянки томатного соусу\n" +
                        "1 1/2 склянки буйволиного сиру моцарела\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до максимальної температури (зазвичай близько 500°F або 260°C) з внутрішнім піцца-каменем.\n" +
                        "Тонко розкатайте тісто для піци на борошняній поверхні.\n" +
                        "Перенесіть тісто на папір для випічки.\n" +
                        "Рівномірно розподіліть томатний соус, залишаючи краї для корки.\n" +
                        "Додайте ломки буффало моцарелі і посипте сіллю та перцем.\n" +
                        "Поставте піццу (разом з папером для випічки) на розігрітий піцца-камінь.\n" +
                        "Випікайте приблизно 10-12 хвилин, або поки корка не стане золотистою, а сир не розтане і не покриється пузирцями.\n" +
                        "Вийміть з духовки, прикрасьте свіжими листками базиліку, полийте оливковою олією і насолоджуйтесь вашою Маргарита з буффало, ідеальним поєднанням смаків і текстур.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 75,
            categoryOfFood = "Піца",
            dishTitle = "Піца Романа",
            imageResId = R.drawable.ol_pizza_romana_79,
            description =
            "Піца Романа, також відома як римська піца на сковороді, - смачна італійська страва, що характеризується прямокутною формою та хрусткою, повітряною скоринкою.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (400г)\n" +
                        "Томатний соус (200г)\n" +
                        "Сир моцарела (200г)\n" +
                        "Оливкова олія\n" +
                        "Свіже листя базиліка\n" +
                        "Сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 220°C (430°F).\n" +
                        "Розкачайте тісто для піци за розміром прямокутної форми для випікання, щоб воно було тонким і рівномірно розподіленим.\n" +
                        "Перекладіть тісто на деко і притисніть його до кутів.\n" +
                        "Збризніть тісто оливковою олією.\n" +
                        "Рівномірно розподіляємо томатний соус, залишаючи невеликий бордюр для скоринки.\n" +
                        "Зверху посипаємо подрібненою моцарелою.\n" +
                        "Посолити та поперчити.\n" +
                        "Випікати приблизно 20-25 хвилин або поки скоринка не стане золотистою, а сир не пузириться.\n" +
                        "Дістаньте з духовки, посипте зверху свіжим листям базиліка і подавайте цю чудову піцу в римському стилі.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 76,
            categoryOfFood = "Піца",
            dishTitle = "Піца Сальсіча та Фріаріеллі",
            imageResId = R.drawable.pizza_salsiccia_e_friarielli_80,
            description =
            "Піца Сальсіча і Фріаріеллі - ароматна піца в неаполітанському стилі з сосисками та рабе з броколі.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (достатньо для однієї піци)\n" +
                        "200 г ковбаси, бажано італійської\n" +
                        "150г броколі рабе (фріаріеллі)\n" +
                        "Томатний соус\n" +
                        "Сир моцарела\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури (зазвичай близько 475-500°F або 245-260°C) або скористайтеся піччю для піци, якщо така є.\n" +
                        "Розкачайте тісто для піци в круглу або прямокутну форму, залежно від ваших уподобань.\n" +
                        "Намажте тісто тонким шаром томатного соусу, залишивши невеликий бордюр для скоринки.\n" +
                        "Рівномірно додаємо подрібнений сир моцарела.\n" +
                        "Окремо готуємо ковбасу та фріареллі. Готову ковбасу нарізати скибочками.\n" +
                        "Викласти ковбасу та фріареллі на піцу.\n" +
                        "Збризніть зверху оливковою олією, посоліть і поперчіть.\n" +
                        "Випікайте піцу приблизно 10-12 хвилин або поки скоринка не стане золотистою, а сир не пузириться.\n" +
                        "Дістаньте з духовки, дайте їй трохи охолонути, потім наріжте і насолоджуйтеся піцою \"Сальсіча і Фріаріеллі\".",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 77,
            categoryOfFood = "Піца",
            dishTitle = "Піца Фрутті ді Маре",
            imageResId = R.drawable.pizza_frutti_di_mare_81,
            description =
            "Піца Фрутті ді Маре - чудова італійська піца з морепродуктами, відома своєю великою кількістю смаків свіжих морепродуктів.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (достатньо для однієї піци)\n" +
                        "Томатний соус або пассата\n" +
                        "200 г змішаних морепродуктів (креветки, мідії, кальмари, молюски)\n" +
                        "1/2 склянки сиру моцарела\n" +
                        "Свіже листя базиліка\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець за смаком\n" +
                        "Пластівці червоного перцю (за бажанням, для більшої гостроти)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури (зазвичай близько 475-500°F або 245-260°C) або скористайтеся піччю для піци, якщо вона є.\n" +
                        "Розкачайте тісто для піци в круглу або прямокутну форму.\n" +
                        "Рівномірно розподіліть тонкий шар томатного соусу або пасти на тісті.\n" +
                        "Рівномірно викладіть суміш морепродуктів та сир моцарела.\n" +
                        "Посоліть, поперчіть та додайте пластівці червоного перцю (за бажанням).\n" +
                        "Збризніть зверху оливковою олією.\n" +
                        "Випікайте піцу приблизно 10-12 хвилин або поки скоринка не стане золотистою, а морепродукти не приготуються.\n" +
                        "Дістаньте з духовки, прикрасьте свіжим листям базиліка, наріжте і насолоджуйтеся піцою Фрутті ді Маре, наповненою океанськими ароматами.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 78,
            categoryOfFood = "Піца",
            dishTitle = "Піца з грибами та трюфелем",
            imageResId = R.drawable.pizza_z_grybamy_ta_trufelem_78,
            description =
            "Піца з грибами та трюфелем - це вишукана італійська піца, що поєднує в собі землистий смак грибів та розкішну есенцію трюфелів.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Тісто для піци (достатньо для однієї піци)\n" +
                        "Томатний соус або пассата\n" +
                        "200 г свіжих грибів, тонко нарізаних (наприклад, печериці або шампіньйони)\n" +
                        "Трюфельний крем або трюфельна олія\n" +
                        "Сир моцарела, подрібнений\n" +
                        "Сир пармезан, натертий на тертці\n" +
                        "Свіже листя чебрецю\n" +
                        "Оливкова олія\n" +
                        "Сіль і перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до найвищої температури (зазвичай близько 475-500°F або 245-260°C).\n" +
                        "Розкачайте тісто для піци в круглу форму.\n" +
                        "Намастіть тісто тонким шаром томатного соусу або пасти.\n" +
                        "Рівномірно розподіліть нарізані гриби на соусі.\n" +
                        "Збризнути гриби трюфельним кремом або олією.\n" +
                        "Зверху посипати сиром моцарела і трохи пармезану.\n" +
                        "Посолити, поперчити, додати свіжі листочки чебрецю.\n" +
                        "Збризніть піцу оливковою олією.\n" +
                        "Випікайте приблизно 10-12 хвилин, поки скоринка не стане золотистою, а сир не пузириться.\n" +
                        "Наріжте і насолоджуйтеся вишуканою піцою з грибами та трюфелем - гармонійним поєднанням лісового та трюфельного ароматів.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 80,
            categoryOfFood = "Гарніри",
            dishTitle = "Різотто по-міланськи",
            imageResId = R.drawable.risotto_alla_milanese_50,
            description =
            "\"Різотто по-міланськи\" - вершкова італійська страва з рису з шафраном, що надає їй яскравого жовтого кольору. Не має особливих дієтичних обмежень. Це класична, заспокійлива страва, яка містить близько 300 калорій на порцію. Різотто по-міланськи - насичене та оксамитове різотто, відоме своїм золотистим відтінком, який досягається завдяки шафрановому настою. Це розкішна, заспокійлива італійська страва. Більшість рецептів розраховані на 4 персони.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 1/2 склянки рису Арборіо\n" +
                        "4 склянки курячого або овочевого бульйону\n" +
                        "1 невелика цибулина, дрібно нарізана\n" +
                        "2 столові ложки вершкового масла\n" +
                        "2 столові ложки оливкової олії\n" +
                        "1/2 склянки сухого білого вина\n" +
                        "1/4 чайної ложки шафранових ниток\n" +
                        "1/2 склянки тертого пармезану\n" +
                        "Сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Нагріваємо бульйон у каструлі та додаємо нитки шафрану, щоб рідина набула кольору та аромату.\n" +
                        "В окремій сковороді розігріваємо вершкове масло та оливкову олію. Обсмажте дрібно нарізану цибулю до напівпрозорості.\n" +
                        "Додаємо рис Арборіо і готуємо ще пару хвилин, поки він не стане напівпрозорим по краях.\n" +
                        "Вливаємо біле вино і перемішуємо, поки воно повністю не вбереться.\n" +
                        "Починайте додавати шафрановий бульйон по одному ополонику за раз, часто помішуючи і даючи рідині вбратися, перш ніж додавати більше.\n" +
                        "Продовжуйте цей процес, поки рис не стане кремоподібним і не розвариться, але все ще буде злегка аль денте (зазвичай близько 18-20 хвилин).\n" +
                        "Зніміть з вогню, додайте тертий пармезан, посоліть і поперчіть.\n" +
                        "Подавайте вершкове різотто по-міланськи гарячим, прикрасивши додатково пармезаном за бажанням. Смачного!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 81,
            categoryOfFood = "Гарніри",
            dishTitle = "Полента",
            imageResId = R.drawable.polenta_51,
            description =
            "Полента - універсальна італійська страва з кукурудзяного борошна. Вона не містить глютену, що робить її придатною для тих, хто дотримується дієтичних обмежень. Поленту можна подавати вершковою або твердою, її калорійність залежить від способу приготування. Як правило, це близько 150 калорій на 100 г. Полента - це страва з кукурудзяного борошна, яка може бути рідкою або твердою, залежно від способу приготування. Це основний продукт північної італійської кухні, часто як гарнір або основа для різних начинок. Рецепт можна змінювати залежно від кількості порцій.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 склянка грубого кукурудзяного борошна\n" +
                        "4 склянки води або бульйону\n" +
                        "Сіль за смаком\n" +
                        "Вершкове масло або оливкова олія (за бажанням)\n" +
                        "Тертий сир (пармезан або інший) (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Закип'ятіть воду або бульйон у великій каструлі та посоліть.\n" +
                        "Поступово всипати кукурудзяне борошно в киплячу рідину, безперервно збиваючи, щоб уникнути утворення грудочок.\n" +
                        "Зменшити вогонь до мінімуму і варити, часто помішуючи, поки полента не загусне (зазвичай близько 30 хвилин). За потреби додати ще рідини.\n" +
                        "За бажанням додайте вершкове масло або оливкову олію та тертий сир для додаткового аромату та вершковості.\n" +
                        "Коли полента стане густою та кремоподібною, зніміть її з вогню.\n" +
                        "Ви можете подавати її гарячою і м'якою або перелити на сковороду, щоб вона охолола і застигла для подальшої нарізки та смаження на грилі.\n" +
                        "Смакуйте поленту з різними начинками, такими як рагу, гриби або сир.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 82,
            categoryOfFood = "Гарніри",
            dishTitle = "Капоната",
            imageResId = R.drawable.caponata_52,
            description =
            "Капоната - сицилійська страва, відома своїм кисло-солодким смаком. Вона підходить для різних дієтичних уподобань, в тому числі вегетаріанців і веганів. До складу цієї страви входять баклажани, помідори, цибуля та каперси, які створюють чудовий середземноморський смак. Зазвичай вона містить близько 150 калорій на 1 склянку порції.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 великі баклажани, нарізані кубиками\n" +
                        "1 цибулина, дрібно нарізана\n" +
                        "3 стебла селери, нарізані\n" +
                        "1 банка (14 унцій) помідорів, нарізаних кубиками\n" +
                        "1/4 склянки червоного винного оцту\n" +
                        "1/4 склянки оливкової олії\n" +
                        "3 ст.л. цукру\n" +
                        "2 ст.л. каперсів\n" +
                        "2 ст.л. подрібненого свіжого базиліка\n" +
                        "Сіль та перець за смаком",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У великій сковороді розігріти оливкову олію на середньому вогні. Додати нарізані кубиками баклажани і обсмажувати, поки вони не стануть м'якими і золотистими, потім витягнути і відкласти в сторону.\n" +
                        "Додайте ще оливкової олії, якщо потрібно, в ту ж сковорідку і обсмажте цибулю та селеру до м'якості.\n" +
                        "Додайте в сковороду нарізані кубиками помідори, оцет і цукор. Готуйте близько 10 хвилин, щоб аромати змішалися.\n" +
                        "Додайте пасеровані баклажани, каперси та нарізаний базилік. Готуйте ще 5 хвилин.\n" +
                        "Посолити та поперчити капонату за смаком.\n" +
                        "Зняти з вогню, дати охолонути до кімнатної температури і поставити в холодильник принаймні на кілька годин перед подачею. Капонату найкраще подавати холодною або кімнатної температури як гарнір чи закуску.\n" +
                        "Насолоджуйтесь домашньою капонатою з її багатим смаком та універсальністю італійської кухні.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 83,
            categoryOfFood = "Гарніри",
            dishTitle = "Перець печений",
            imageResId = R.drawable.perec_pechenyi_83,
            description =
            "Печений перець - класична італійська страва, яку можна подавати як закуску або гарнір. Зазвичай вона не пов'язана з певними дієтичними обмеженнями, що робить її універсальним вибором. Печений перець солодкий, димчастий та яскравий. Кожна порція містить приблизно 40-50 калорій.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 червоних болгарських перцю\n" +
                        "2 столові ложки оливкової олії\n" +
                        "Сіль і перець за смаком\n" +
                        "За бажанням: часник, зелень або оцет для додаткового смаку",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігріти духовку до 450°F (232°C).\n" +
                        "Вимийте та висушіть перець. Викладіть його на деко.\n" +
                        "Запікайте перець у духовці приблизно 30-40 хвилин, час від часу перевертаючи його, поки шкірка не обвуглиться і не покриється пухирями.\n" +
                        "Вийміть перець з духовки і покладіть його в герметичний поліетиленовий пакет або закриту миску на пару на 1015 хвилин. Це полегшить зняття шкірки.\n" +
                        "Після приготування на пару зняти шкірку, видалити насіння і нарізати перець соломкою.\n" +
                        "Збризніть оливковою олією, посоліть, поперчіть та додайте будь-які інші інгредієнти за бажанням для додаткового смаку.\n" +
                        "Подавайте смажений перець як гарнір, у салатах, бутербродах або на тарілках з пастою.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 84,
            categoryOfFood = "Гарніри",
            dishTitle = "Смажені квіти кабачків",
            imageResId = R.drawable.smazeni_kvity_kabachkiv_84,
            description =
            "\"Смажені квіти кабачків\", прекрасна італійська закуска, зазвичай подаються без конкретних обмежень у харчуванні. Ці ніжні квіти мають хрустку скоринку ззовні, ніжну середину і повні смаку. Кожна порція зазвичай містить приблизно 100-150 калорій.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "12 квіток кабачків\n" +
                        "1 склянка універсального борошна\n" +
                        "1 склянка газованої води або пива\n" +
                        "Сіль і перець за смаком\n" +
                        "Рослинна олія для смаження\n" +
                        "За бажанням: сир моцарела, анчоуси або зелень для начинки",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Обережно помийте квіти кабачків і видаліть пилюку зсередини.\n" +
                        "За бажанням, наповніть кожну квітку невеликим шматочком моцарели, анчоусами або травами.\n" +
                        "У мисці змішайте муку, газовану воду або пиво, сіль і перець до отримання гладкої суміші.\n" +
                        "Розігрійте рослинну олію в глибокій сковороді або каструлі.\n" +
                        "Обмацайте кожну квітку кабачка в тісто, рівномірно покриваючи його.\n" +
                        "Смажте квіти в гарячій олії до золотистої коричневої скоринки і хрусткості, зазвичай близько 2-3 хвилин з кожного боку.\n" +
                        "Вийміть їх шумовкою і відкладіть на рушники, щоб зняти зайву олію.\n" +
                        "Подавайте смажені квіти кабачків гарячими, як чудову закуску або гарнір.\n" +
                        "Це рецепт смажених квітів кабачків, які можна подавати гарячими як чудову закуску чи гарнір.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 85,
            categoryOfFood = "Гарніри",
            dishTitle = "Салат Фарро",
            imageResId = R.drawable.farro_salad_55,
            description =
            "Італійський салат фарро - це корисна та поживна страва, яка зазвичай не має особливих дієтичних обмежень. До складу цього салату входять жувальні зерна фарро, свіжі овочі та іноді сир. Це універсальний варіант гарніру або основної страви. Порція містить близько 250-300 калорій.",
            ingredients = listOf(
                "Інгредієнти (приблизно на 4 порції):\n" ,
                        "1 склянка фарро\n" +
                        "2 склянки води або бульйону\n" +
                        "1 склянка помідорів черрі, розрізаних навпіл\n" +
                        "1/2 склянки огірка, нарізаного кубиками\n" +
                        "1/4 склянки червоної цибулі, дрібно нарізаної\n" +
                        "1/4 склянки свіжого листя базиліка, подрібненого\n" +
                        "1/4 склянки сиру фета (за бажанням)\n" +
                        "Оливкова олія, лимонний сік, сіль та перець для заправки",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Промийте фарро під холодною водою. У каструлі поєднайте фарро та воду або бульйон. Доведіть до кипіння, а потім зменште вогонь і готуйте приблизно 20-25 хвилин, поки фарро не стане ніжним, але все ще жорстким. Злейте зайву рідину.\n" +
                        "У великій мисці поєднайте готовий фарро, чері помідори, огірок, червону цибулю і базилік.\n" +
                        "За бажанням, додайте сир фета для більш насиченого смаку.\n" +
                        "Полийте оливковою олією і соком лимона, і приправте сіллю та перцем. Перемішайте.\n" +
                        "Поставте в холодильник принаймні 30 хвилин перед подачею, щоб смаки поєдналися.\n" +
                        "Подавайте італійський салат із фарро як освіжаючий гарнір або легку страву, ідеальну для теплих днів.\n" +
                        "Це рецепт італійського салату із фарро, який можна подавати як освіжаючий гарнір чи легку страву, ідеальну для теплих днів.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 86,
            categoryOfFood = "Гарніри",
            dishTitle = "Рапіні з часником та оливковою олією",
            imageResId = R.drawable.rappini_salad_86,
            description =
            "Рапіні з часником та оливковою олією - класична італійська страва, яка зазвичай підходить для різних дієтичних уподобань. У цій страві ніжні рапіні пасеруються з часником та оливковою олією, створюючи ароматний і злегка гіркуватий гарнір або начинку. Порція містить приблизно 100-150 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "1 пучок рапіні (броколі рабе)\n" +
                        "23 зубчики часнику, тонко нарізані\n" +
                        "3 столові ложки оливкової олії\n" +
                        "Сіль і пластівці червоного перцю (за бажанням)\n" +
                        "Тертий сир Пекоріно Романо (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Помити рапіні та обрізати жорсткі кінці.\n" +
                        "У великій каструлі довести до кипіння підсолену воду. Бланшувати рапіні приблизно 23 хвилини, поки вони не стануть м'якими, але не втратять яскравий зелений колір. Відцідити воду і відставити.\n" +
                        "У великій сковороді розігріти оливкову олію на середньому вогні. Додайте нарізаний часник і пластівці червоного перцю за бажанням. Обсмажуйте, поки часник не стане ароматним, але не підрум'яниться.\n" +
                        "Додати до сковороди бланшовані рапіні і смажити ще 23 хвилини, перевертаючи, щоб вони вкрилися часниковою олією.\n" +
                        "Посолити за смаком і зняти з вогню.\n" +
                        "За бажанням можна посипати тертим сиром Пекоріно Романо.\n" +
                        "Подавати рапіні з часником та оливковою олією як гарнір або з пастою.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 87,
            categoryOfFood = "Гарніри",
            dishTitle = "Полента на грилі",
            imageResId = R.drawable.polenta_on_grill_87,
            description =
            "Полента на грилі - смачна італійська страва з кукурудзяного борошна. Зазвичай вона не містить глютену і підходить для вегетаріанської дієти. Порція поленти на грилі містить близько 150 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "1 склянка поленти (кукурудзяного борошна)\n" +
                        "4 склянки води\n" +
                        "Сіль і перець за смаком\n" +
                        "Оливкова олія для смаження",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У каструлі довести до кипіння 4 склянки води. Додайте дрібку солі.\n" +
                        "Поступово всипати 1 склянку поленти, постійно помішуючи, щоб не було грудочок.\n" +
                        "Зменшити вогонь до мінімуму і продовжувати помішувати приблизно 1520 хвилин, поки суміш не загусне і не почне відставати від стінок каструлі.\n" +
                        "Вилити готову поленту на деко або тарілку і рівномірно розподілити до товщини приблизно 1/2 дюйма. Дати їй охолонути та застигнути щонайменше 30 хвилин.\n" +
                        "Після того, як полента застигне, наріжте її бажаними формами (квадратиками або кружальцями).\n" +
                        "Розігрійте гриль або сковороду-гриль на середньому вогні. Змастіть шматочки поленти оливковою олією.\n" +
                        "Смажте поленту на грилі з кожного боку протягом 45 хвилин, або поки на ній не з'являться сліди від гриля і вона не стане золотистою.\n" +
                        "Подавайте гарячою з улюбленими начинками, такими як овочі-гриль, томатний соус або сир.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 88,
            categoryOfFood = "Гарніри",
            dishTitle = "Ризотто з абрикосами і гребінцями",
            imageResId = R.drawable.risotto_with_apricots_and_scallops_90,
            description =
            "Ризотто з абрикосами і гребінцями - це чудовий кулінарний шедевр, який поєднує в собі ніжну смакову асоціацію ризотто зі солодкими і ароматними нотками абрикосів і соковитих камбали. Зазвичай ця страва починається з рису Арборіо або Карнаролі, який готується до смакової консистенції, поступово додавши гарячий бульйон і постійно помішуючи, щоб вивільнити його крохмалеві речовини.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        " 1 ст.л. вершкового масла\n" +
                        "2 дрібно нарізані цибулини шалот \n" +
                        "1 гілочка розмарину\n" +
                        "300 г рису для різотто (наприклад, арборіо)\n" +
                        "2 склянки білого вина\n" +
                        "9 склянок гарячого курячого бульйону\n" +
                        "80 г тертого пармезану \n" +
                        "сіль і перець за смаком\n" +
                        "400 г абрикосів, розрізаних на четвертинки\n" +
                        " 2 ст.л. води \n" +
                        "1 гілочка подрібненого розмарину\n" +
                        "1 ч.л. пластівців чилі\n" +
                        "4 ч.л. солі\n" +
                        "1 ст.л. оливкової олії\n" +
                        "12 гребінців \n" +
                        "1 ч.л. солі",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Різотто: розтопити вершкове масло в каструлі. Нарізати цибулю-шалот і розмарин. Додайте рис і варіть, помішуючи, поки він не стане прозорим. Змочіть вином, дайте йому майже повністю випаруватися. Під час варіння вливаємо бульйон, часто помішуючи та стежачи за тим, щоб рис все ще був покритий рідиною. Тушкуємо на повільному вогні. 20 хвилин, поки рис не стане кремоподібним і не розвариться до стану аль денте. Додайте сир і вершкове масло, приправте\n" +
                        "Абрикоси: змішайте абрикоси з водою, роменом і чилі в каструлі, накрийте кришкою і тушкуйте близько 3 хвилин, посоліть.\n" +
                        "Гребінці: для приготування розігріти олію в антипригарній сковороді. " +
                        "Додати гребінці, обсмажувати приблизно по 2 хвилини з кожного боку. Викласти різотто, розподілити гребінці та абрикоси."
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 90,
            categoryOfFood = "Десерти",
            dishTitle = "Тірамісу",
            imageResId = R.drawable.tiramisu_58,
            description =
            "Тірамісу - це класичний італійський десерт, відомий своїми вершково-кавовими шарами. Зазвичай він містить кофеїн з кави та сирих яєць, тому не підходить для тих, хто має дієтичні обмеження, пов'язані з кофеїном або сирими яйцями. Одна порція тірамісу містить приблизно 300 калорій.",
            ingredients = listOf(
                "Інгредієнти (на 6 порцій):\n" ,
                        "6 яєчних жовтків\n" +
                        "3/4 склянки цукрового піску\n" +
                        "1 склянка сиру маскарпоне\n" +
                        "1 1/2 склянки жирних вершків\n" +
                        "2 чашки звареного еспресо, охолодженого\n" +
                        "1/4 склянки кавового лікеру (за бажанням)\n" +
                        "1 упаковка \"дамських пальчиків\" (близько 24 штук)\n" +
                        "Какао-порошок для посипання\n" +
                        "Стружка чорного шоколаду для прикраси",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У жароміцній посудині збийте жовтки з 1/2 склянки цукру на пароварці до світло-кремового кольору.\n" +
                        "Зніміть з вогню і додайте сир маскарпоне, перемішуючи до повного злиття.\n" +
                        "В окремій мисці збити жирні вершки до утворення стійких піків.\n" +
                        "Обережно додати збиті вершки до суміші з маскарпоне.\n" +
                        "У неглибокій тарілці змішати заварений еспресо та кавовий лікер.\n" +
                        "Швидко занурити кожну паличку в еспресо-суміш, щоб вона просочилася, але не розмокла.\n" +
                        "Викладіть вмочені палички на блюдо для подачі шар за шаром.\n" +
                        "Викласти на них половину суміші з маскарпоне.\n" +
                        "Повторити з іншим шаром вмочених філе і рештою суміші маскарпоне.\n" +
                        "Поставити в холодильник мінімум на 4 години або на ніч.\n" +
                        "Перед подачею посипати верх какао-порошком і прикрасити стружкою чорного шоколаду.\n" +
                        "Подавайте охолодженим і насолоджуйтеся соковитим тірамісу!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 91,
            categoryOfFood = "Десерти",
            dishTitle = "Каннолі",
            imageResId = R.drawable.cannoli_59,
            description =
            "Каннолі - чудовий італійський десерт, відомий своїми хрусткими оболонками з тіста та вершковою начинкою з рикотти. Це ситне і поблажливе частування, тому воно може не підійти тим, хто дотримується дієти з обмеженнями на молочні продукти або цукор. Типовий каннолі містить близько 100-150 калорій на порцію.",
            ingredients = listOf(
                "Інгредієнти (на 12 каннолі):\n" ,
                        "2 склянки сиру рікотта\n" +
                        "1/2 склянки цукрової пудри\n" +
                        "1/2 чайної ложки ванільного екстракту\n" +
                        "1/4 склянки міні-шоколадної стружки\n" +
                        "12 формочок для каннолі (магазинних або домашніх)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У мисці змішайте сир рікотта, цукрову пудру та ванільний екстракт до однорідної маси.\n" +
                        "Акуратно додайте міні-шоколадні чіпси.\n" +
                        "Наповніть кожну оболонку Каннолі сумішшю з рікотти за допомогою кондитерського мішка або ложки.\n" +
                        "Притрусіть кінці цукровою пудрою або обваляйте в подрібнених фісташках чи шоколадній крихті для додаткового смаку та текстури.\n" +
                        "Подавайте каннолі негайно, щоб насолодитися ідеальним поєднанням хрусткої та вершкової текстури",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 92,
            categoryOfFood = "Десерти",
            dishTitle = "Панна-Котта",
            imageResId = R.drawable.panna_cotta_60,
            description =
            "Панна-Котта - класичний італійський десерт, відомий своєю кремовою, заварною текстурою. Він, як правило, не підходить для тих, хто має дієтичні обмеження на молочні продукти. Типова порція ванільної панна-котти містить близько 250-300 калорій. Це простий, але елегантний десерт.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "2 склянки жирних вершків\n" +
                        "1/2 склянки цукрового піску\n" +
                        "1 стручок ванілі або 2 чайні ложки ванільного екстракту\n" +
                        "2 1/4 чайної ложки желатину\n" +
                        "3 столові ложки холодної води",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У каструлі змішайте жирні вершки та цукор. Якщо використовуєте ванільний стручок, вишкребіть насіння в суміш, якщо ні - додайте ванільний екстракт.\n" +
                        "В окремій мисці залийте желатин холодною водою і залиште на кілька хвилин, щоб він набряк.\n" +
                        "Нагрійте вершкову суміш на середньому вогні, поки вона не стане гарячою, але не киплячою.\n" +
                        "Зніміть з вогню і перемішайте суміш з желатином, доки він не розчиниться.\n" +
                        "Розлити суміш у сервірувальні склянки або креманки.\n" +
                        "Поставте в холодильник мінімум на 4 години або до повного застигання.\n" +
                        "Подавати панна-котту охолодженою, прикрасивши свіжими ягодами або поливаючи карамельним соусом.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 93,
            categoryOfFood = "Десерти",
            dishTitle = "Джелато",
            imageResId = R.drawable.dzellatto_93,
            description =
            "Джелато - це чудовий італійський заморожений десерт, схожий на морозиво, але більш вершковий і щільніший. Зазвичай він не підходить для тих, хто має обмеження на молочні продукти. Порція морозива містить близько 100-130 калорій, залежно від смаку.",
            ingredients = listOf(
                "Інгредієнти (на 4 порції):\n" ,
                        "2 склянки незбираного молока\n" +
                        "1 склянка жирних вершків\n" +
                        "3/4 склянки цукрового піску\n" +
                        "1 стручок ванілі або 1 чайна ложка ванільного екстракту\n" +
                        "Ароматизатори, такі як фрукти, шоколад або горіхи (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У каструлі змішайте молоко та вершки. Якщо ви використовуєте ванільний стручок, розділіть його та вишкребіть насіння в суміш, якщо ні - додайте ванільний екстракт.\n" +
                        "Нагрійте суміш на середньому вогні, поки вона не стане гарячою, але не кипітиме.\n" +
                        "Зніміть з вогню і дайте трохи охолонути.\n" +
                        "В окремій мисці збиваємо цукор до повного розчинення.\n" +
                        "Поступово додайте цукор до молочної суміші, доки суміш не стане однорідною.\n" +
                        "Перекладіть суміш у мороженицю та збивайте відповідно до інструкцій виробника.\n" +
                        "В останні кілька хвилин збивання додайте обрані вами ароматизатори.\n" +
                        "Після цього перекладіть морозиво в герметичний контейнер і заморозьте на кілька годин до повного застигання.\n" +
                        "Подавайте морозиво в креманках або конусах, прикрасивши свіжими фруктами або горіхами.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 94,
            categoryOfFood = "Десерти",
            dishTitle = "Цепполі",
            imageResId = R.drawable.ceppolli_94,
            description =
            "Цепполі - традиційна італійська випічка, особливо популярна на День Святого Йосипа. Це смажені у фритюрі кульки з тіста, схожі на пончики, але з унікальною текстурою. Через процес обсмажування дзепполе не підходять для тих, хто дотримується суворої дієти. Десерт. Приблизно 150 калорій на порцію. Зепполі - легкі, повітряні, злегка хрусткі зовні. Зазвичай їх подають з цукровою пудрою та іноді з вишнею зверху, що робить їх солодкою насолодою.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 склянка води\n" +
                        "1/2 склянки несолоного вершкового масла\n" +
                        "1 склянка борошна грубого помелу\n" +
                        "Щіпка солі\n" +
                        "4 великих яйця\n" +
                        "Рослинна олія для смаження\n" +
                        "Цукрова пудра для посипання\n" +
                        "Вишні мараськіно (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У каструлі змішати воду та вершкове масло. Довести до кипіння.\n" +
                        "Одразу додати борошно та дрібку солі. Інтенсивно перемішуйте, поки суміш не утворить кулю.\n" +
                        "Зніміть з вогню і дайте охолонути кілька хвилин.\n" +
                        "Вбиваємо яйця по одному, поки тісто не стане однорідним.\n" +
                        "Нагріти олію у фритюрниці або важкій каструлі до 375°F (190°C).\n" +
                        "Викладати ложками тісто в гарячу олію. Смажити до золотистої скоринки, приблизно 4 хвилини.\n" +
                        "Вийняти шумівкою і викласти на паперові рушники.\n" +
                        "Притрусити цукровою пудрою і за бажанням прикрасити вишнями мараскіно.\n" +
                        "Насолоджуйтесь домашнім цепполе, чудовими італійськими ласощами!",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 95,
            categoryOfFood = "Десерти",
            dishTitle = "Біскотті",
            imageResId = R.drawable.biscotti_63,
            description =
            "Біскотті - традиційне італійське мигдальне печиво. Вони не підходять для людей з алергією на горіхи через мигдаль. Біскотті - це печиво, яке випікається двічі, завдяки чому воно має хрустку текстуру, ідеально підходить для вмочування в каву або вино. На одну порцію припадає близько 110 калорій. Десерт. Приблизно 110 калорій на порцію, біскотті - це печиво довгастої форми з чудовим хрустким смаком. Вони часто ароматизовані мигдалем і мають ледь вловиму солодкість. Біскотті зазвичай подають з кавою або десертним вином, а також можна вмочати, щоб пом'якшити їхню текстуру. Рецепт розрахований на отримання близько 20 біскотті.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 склянки борошна грубого помелу\n" +
                        "1 1/2 чайної ложки розпушувача\n" +
                        "1/4 чайної ложки солі\n" +
                        "1/2 склянки несолоного вершкового масла кімнатної температури\n" +
                        "1 склянка цукрового піску\n" +
                        "2 великі яйця\n" +
                        "1 чайна ложка ванільного екстракту\n" +
                        "1 склянка цільного мигдалю",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 350°F (175°C).\n" +
                        "У мисці збийте разом борошно, розпушувач і сіль.\n" +
                        "В окремій мисці збийте вершкове масло з цукром до однорідної світлої маси.\n" +
                        "Вбийте яйця по одному, а потім додайте ваніль.\n" +
                        "Поступово додайте сухі інгредієнти та мигдаль.\n" +
                        "Розділіть тісто навпіл і надайте кожній половині форми колоди довжиною приблизно 12 дюймів і шириною 2 дюйми.\n" +
                        "Викладіть колоди на деко і випікайте 25-30 хвилин, або поки вони не стануть світло-коричневими.\n" +
                        "Вийміть з духовки і дайте охолонути кілька хвилин. Потім наріжте колоди скибочками по 1/2 дюйма.\n" +
                        "Покладіть скибочки на деко і випікайте ще 6-10 хвилин, або поки вони не стануть золотисто-коричневими і хрусткими.\n" +
                        "Перед подачею дайте їм охолонути. Насолоджуйтесь домашнім біскотті!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 96,
            categoryOfFood = "Десерти",
            dishTitle = "Забайоне",
            imageResId = R.drawable.zabaione_64,
            description =
            "Забайоне, також відомий як Забальоне, - це італійський заварний десерт з кремовою, пінистою текстурою. Його готують з яєчних жовтків, цукру та солодкого вина, найчастіше марсали. Не має особливих дієтичних обмежень, якщо тільки ви не боїтеся вживати сирі яйця. Десерт. Приблизно 220 калорій на порцію, Забайоне - це соковитий італійський десерт, відомий своєю насиченою, оксамитовою текстурою і солодким, насиченим вином смаком. Його часто подають як самостійний десерт або зі свіжими ягодами чи тортом. За рецептом зазвичай подається на 4 персони.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 великих яєчних жовтки\n" +
                        "1/4 склянки цукрового піску\n" +
                        "1/2 склянки солодкого вина Марсала\n" +
                        "Свіжі ягоди або інші начинки (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У жароміцній мисці збийте яєчні жовтки з цукром до однорідної маси.\n" +
                        "Поставте миску над каструлею з киплячою водою (пароварка) і додайте вино \"Марсала\".\n" +
                        "Безперервно збивайте приблизно 8-10 хвилин, поки суміш не стане густою, пінистою і не збільшиться в об'ємі втричі. Вона повинна бути нагрітою, але не кипіти.\n" +
                        "Зніміть з вогню і продовжуйте збивати протягом хвилини, коли суміш трохи охолоне.\n" +
                        "Подавайте теплим у десертних келихах, прикрасивши свіжими ягодами або будь-якими іншими топінгами за бажанням. Смачного вам домашнього забайоне!"
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 97,
            categoryOfFood = "Десерти",
            dishTitle = "Амаретто Семіфреддо",
            imageResId = R.drawable.amaretto_semifreddo_65,
            description =
            "Амаретто Семіфреддо - чудовий італійський заморожений десерт зі смаком лікеру амаретто та мигдалю. Він насичений і вершковий, схожий на морозиво, але легший за текстурою. Особливих дієтичних обмежень для цього десерту немає. Десерт. Кількість калорій може змінюватися залежно від рецепту, але це приблизно 250-300 калорій на порцію. Амаретто Семіфреддо - це напівзаморожений десерт, який поєднує в собі горіховий смак амаретто та солодкість печива амаретто. Це чудові ласощі з кремовою текстурою, які ідеально підходять для солодкого завершення італійської трапези. Зазвичай рецепт розрахований на 6 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "3 великих яєчних жовтки\n" +
                        "1/2 склянки цукрового піску\n" +
                        "2 столові ложки лікеру амаретто\n" +
                        "1 1/4 склянки жирних вершків\n" +
                        "1/2 склянки подрібненого печива амаретті\n" +
                        "Нарізаний мигдаль та додаткове печиво для прикраси (за бажанням)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У жароміцній мисці збийте яєчні жовтки з цукром. Поставити миску над каструлею з киплячою водою (пароварка) і збивати, поки суміш не загусне.\n" +
                        "Зніміть з вогню і додайте лікер амаретто. Дати охолонути до кімнатної температури.\n" +
                        "Збиваємо жирні вершки до утворення стійких піків.\n" +
                        "Акуратно додати яєчну суміш до збитих вершків.\n" +
                        "Додати подрібнене печиво амаретті.\n" +
                        "Вилити суміш у форму для батона, застелену поліетиленовою плівкою.\n" +
                        "Заморозити мінімум на 4 години або до повного застигання.\n" +
                        "Подавати на шматочках семіфреддо, прикрасивши мигдалем і додатковим печивом амаретті, за бажанням.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 98,
            categoryOfFood = "Десерти",
            dishTitle = "Аффогато",
            imageResId = R.drawable.affogato_66,
            description =
            "Аффогато - класичний італійський десерт, який складається з кульки ванільного морозива або джелато, \"втопленого\" в чашці гарячого еспресо. Особливих дієтичних обмежень для цього десерту немає. Десерт. Приблизно 100-150 калорій на 1 порцію. Аффогато - це простий, але вишуканий десерт, в якому гарячий еспресо розтоплює холодне вершкове морозиво, створюючи чудове поєднання смаків і температур. Це швидкий і легкий десерт, який задовольнить ваші солодкі пристрасті. Зазвичай рецепт розрахований на одну порцію, але його можна помножити на кілька.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "1 кулька ванільного морозива або джелато\n" +
                        "1 чашка гарячого еспресо\n" +
                        "Додатково: шоколадна стружка, подрібнені горіхи або крапля лікеру, наприклад, амаретто (для варіацій)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Покладіть кульку ванільного морозива або желе в склянку або чашку для подачі.\n" +
                        "Заваріть порцію гарячого еспресо за допомогою кавоварки для еспресо або кавоварки Мокка.\n" +
                        "Полийте гарячий еспресо на морозиво.\n" +
                        "За бажанням, прикрасьте шоколадними стружками, нарізаними горіхами або покапайте лікером, наприклад, Амаретто.\n" +
                        "Подавайте негайно і насолоджуйтеся, доки морозиво тане в каві.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 99,
            categoryOfFood = "Десерти",
            dishTitle = "Пиріг з абрикосами у фритюрі",
            imageResId = R.drawable.pyrig_z_abrykodamy_u_frytiuri_99,
            description =
            "Пиріг з абрикосами у глазурі - це чудовий десерт, який поєднує в собі солодкість стиглих абрикосів з насиченим і злегка карамелізованим смаком глазурі, приготованої у глазурі. Основа цього пирога зазвичай складається з масляної та листкової скоринки тіста. Потім його наповнюють соковитою сумішшю свіжих абрикосів та мигдального крему, відомою як франжипан. Унікальний елемент фламбування полягає у підпалюванні лікеру (найчастіше абрикосового бренді або подібного) над пирогом безпосередньо перед подачею на стіл. Цей процес не лише додає десерту драматичного колориту, але й надає йому теплого, п'янкого аромату та смаку. В результаті виходить гарно підрум'янений, ароматний пиріг з ніжними абрикосами, які увібрали в себе чудову есенцію лікеру фламбед. Це чудове поєднання текстур і смаків, яке неодмінно вразить любителів десертів.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "300 г білої муки\n" +
                        "1 чайна ложка солі\n" +
                        "дріжджі в кубиках (приблизно 10 г), подрібнені\n" +
                        "1½ дл води\n" +
                        "½ дл оливкової олії\n" +
                        "1 столова ложка меду\n" +
                        "100 г сметани\n" +
                        "100 г сиру з голубими жилками (наприклад, Горгонзола), нарізаний на кусочки\n" +
                        "200 г нарізаних абрикосів\n" +
                        "пучок зірочок тим'яну\n" +
                        "50 г руколи\n" +
                        "½ столової ложки рідкого меду\n" +
                        "1-2 чайних ложки флер де сель (морська сіль)\n" +
                        "трохи перцю",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Тісто: Змішати борошно, сіль і дріжджі. Додати воду, олію і мед, перемішати маленькою лопаткою до утворення м'якого тіста. м'яке тісто, \n" +
                        "недовго вимісити, накрити кришкою і залишити приблизно на 10 хвилин.\n" +
                        "Формування: розрізати тісто на 4 частини. На невеликій кількості борошна розкачати шматочки тіста до товщини приблизно 2 мм, щоб сформувати овальні форми, і викласти їх на два дека, застелених папером для випікання.\n" +
                        "Тарт фламбе: змастити макарони сметаною зі сметаною. Прикрасити горгонзолою, абрикосами та чебрецем.\n" +
                        "Час приготування: готувати приблизно 20 хвилин у попередньо розігрітій до 220°C духовці (з вентилятором). Вийняти з духовки, викласти на руколу, полити медом і приправити.\n" +
                        "Варіант: замість горгонзоли використовувати горгонзолу, замість неї - маскарпоне або вершковий сир.",
            )
        ),


        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 100,
            categoryOfFood = "Десерти",
            dishTitle = "Лимонний пиріг (Torta Al Limone)",
            imageResId = R.drawable.lemon_cacke_torla_al_limone_73,
            description =
            "Лимонний торт, відомий італійською як Torta al Limone, - це вишуканий десерт, який демонструє яскравий та пікантний смак лимонів. Цей торт характеризується вологим і ніжним м'якушем, наповненим освіжаючим цитрусовим ароматом і пікантним смаком лимонів. Зазвичай його готують, додаючи лимонну цедру і сік у тісто, створюючи чудовий баланс між солодкістю і терпкістю.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "200 г білої пшеничної муки\n" +
                        "50 г цукру\n" +
                        "4 чайні ложки солі\n" +
                        "80 г холодного вершкового масла, нарізаного на маленькі кубики\n" +
                        "3 дл води\n" +
                        "80 г вершкового масла\n" +
                        "3 столові ложки кукурудзяного крохмалю\n" +
                        "3 столові ложки холодної води\n" +
                        "120 г цукру\n" +
                        "4 свіжі жовтки яєць\n" +
                        "3 органічні лимони, трохи тертої начінки та всі соки\n" +
                        "1 органічний лимон, нарізаний на кружечки\n" +
                        "Для пирога з діаметром приблизно 28 см, з підкладкою дна папером для випікання і змащеними бортами.",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Тісто: змішайте муку, цукор і сіль. Додайте вершкове масло, розітерте все руками до отримання однорідної крихкої маси. Додайте воду і швидко все разом перемішайте, щоб отримати м'яке тісто, не переробляючи його. Розгорніть тісто, накрийте і охолодьте приблизно 30 хвилин.\n" +
                        "Для основи: розкатайте тісто між двома шарами паперу для випікання (приблизно 32 см у діаметрі) і помістіть його на форму для випікання, залишаючи нижній шар. Проколіть дно виделкою.\n" +
                        "Приготування: Випікайте протягом приблизно 20 хвилин у нижній частині розігрітої до 200°C духовки. Вийміть пиріг з духовки, дайте йому охолонути, потім перенесіть на решітку і дайте охолонути.\n" +
                        "Для начинки: в кастрюлі принесіть воду і вершкове масло до кипіння. Розчиніть кукурудзяний крохмаль у воді, додайте цукор і жовтки яєць, перемішайте. Додайте цю суміш до киплячої рідини, постійно помішуючи з використанням віничка. Постійно помішуючи, доведіть до кипіння і відставте. Додайте цедру і сік з лимона (приблизно 2 дл). Влити ще гарячу суміш на дно пирога і дайте охолонути. Накрийте пиріг і поставте в холодильник принаймні 3 години.\n" +
                        "Прикраса: прикрасьте пиріг кружечками лимона.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 101,
            categoryOfFood = "Хліб",
            dishTitle = "Хліб фокачча",
            imageResId = R.drawable.focaccia_bread_67,
            description =
            "Хліб фокачча - це італійська класика, відома своєю м'якою, жувальною текстурою та чудовим ароматом оливкової олії. Він універсальний і ідеально підходить для різних випадків. Як правило, немає особливих дієтичних обмежень, але ви можете адаптувати начинку до своїх уподобань. Фокачча - це плоский італійський хліб, випечений у духовці. Типова порція фокаччі містить близько 150-200 калорій. Фокачча - це пікантний, трав'яний хліб, який часто прикрашають розмарином, оливками або помідорами черрі, що робить його смачним і ароматним частуванням. Зазвичай цей рецепт розрахований на 6-8 осіб.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "4 склянки борошна грубого помелу\n" +
                        "1 пачка (2 1/4 ч.л.) активних сухих дріжджів\n" +
                        "1 1/2 склянки теплої води\n" +
                        "2 ч. л. солі\n" +
                        "1/4 склянки оливкової олії\n" +
                        "Приправи на ваш вибір (розмарин, оливки, маслини, помідори черрі тощо)",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У мисці розчиніть дріжджі в теплій воді. Залишити на 5-10 хвилин до утворення піни.\n" +
                        "У великій мисці змішати борошно і сіль. Влити дріжджову суміш та оливкову олію. Вимішуємо до утворення тіста.\n" +
                        "Вимішувати тісто протягом 57 хвилин, поки воно не стане однорідним та еластичним.\n" +
                        "Викласти тісто в змащену олією миску, накрити вологою тканиною і дати йому піднятися приблизно на 1 годину.\n" +
                        "Розігріти духовку до 475°F (245°C).\n" +
                        "Розкачайте тісто в прямокутник, перекладіть на деко і дайте йому відпочити 15 хвилин.\n" +
                        "Зробіть пальцями заглиблення в тісті, збризніть оливковою олією та додайте обрану вами начинку.\n" +
                        "Випікайте 15-20 хвилин до золотистої скоринки.\n" +
                        "Дайте трохи охолонути, потім наріжте і подавайте до столу.\n" +
                        "\n" +
                        "Насолоджуйтесь домашнім хлібом фокачча!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 102,
            categoryOfFood = "Хліб",
            dishTitle = "Чіабатта",
            imageResId = R.drawable.ciabatta_68,
            description =
            "Чіабатта - класичний італійський хліб, відомий своїм сільським виглядом і жувальною текстурою. Він підходить для більшості дієтичних уподобань, оскільки містить основні інгредієнти хліба. Одна порція зазвичай містить близько 150-200 калорій. Ідеально підходить для бутербродів або подається з оливковою олією та бальзамічним оцтом. Вкажіть частину приготування. На скільки осіб розрахований рецепт? Вкажіть, які інгредієнти потрібні та їх кількість. Зробіть покроковий опис процесу приготування. У рецепті на BBC Good Food не вказано кількість порцій, але зазвичай можна приготувати 1 велику буханку або кілька менших.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "500 г сильного білого хлібного борошна\n" +
                        "10 г солі\n" +
                        "7 г швидких дріжджів\n" +
                        "2 ст.л. оливкової олії\n" +
                        "300 мл води",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Змішайте борошно, сіль і дріжджі у великій мисці.\n" +
                        "Додайте оливкову олію та воду, перемішайте, щоб утворилося м'яке тісто.\n" +
                        "Вимішувати тісто на присипаній борошном поверхні близько 10 хвилин, поки воно не стане гладким та еластичним.\n" +
                        "Покладіть тісто в змащену олією миску, накрийте і залиште на 12 годин підніматися, поки воно не збільшиться вдвічі.\n" +
                        "Розігріти духовку до 220°C (вентилятор на 200°C).\n" +
                        "Надайте тісту форму грубого прямокутника і викладіть на деко.\n" +
                        "Випікайте 25-30 хвилин, доки хліб не стане золотисто-коричневим і не видасть порожнистого звуку при постукуванні по дну.\n" +
                        "Охолодити на решітці перед тим, як нарізати і подавати до столу.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 103,
            categoryOfFood = "Хліб",
            dishTitle = "Гріссіні",
            imageResId = R.drawable.grissini_103,
            description =
            "Гріссіні - тонкі італійські хлібні палички, відомі своєю хрусткістю та простотою. Вони підходять для більшості дієтичних обмежень. В одній порції міститься приблизно 30-50 калорій. Грісіні універсальні, їх можна подавати як закуску, перекус або як доповнення до страв. За цим рецептом виходить близько 20 хлібних паличок.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 склянки борошна грубого помелу\n" +
                        "1 чайна ложка солі\n" +
                        "1/2 чайної ложки цукру\n" +
                        "1 пачка активних сухих дріжджів (приблизно 2 1/4 чайної ложки)\n" +
                        "2/3 склянки теплої води\n" +
                        "2 столові ложки оливкової олії\n" +
                        "За бажанням: кунжут, мак або інші добавки",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "У мисці змішайте теплу воду, цукор і дріжджі. Дати постояти близько 10 хвилин до утворення піни.\n" +
                        "Додайте борошно, сіль та оливкову олію до дріжджової суміші. Перемішайте, щоб утворилося тісто.\n" +
                        "Вимішувати тісто на присипаній борошном поверхні близько 5 хвилин до однорідності.\n" +
                        "Розділіть тісто на 20 рівних частин.\n" +
                        "Розкачайте кожну порцію в тонкий, схожий на олівець, пласт (приблизно 12 дюймів завдовжки) і викладіть на деко.\n" +
                        "Збризніть водою і посипте додатковими начинками.\n" +
                        "Випікайте при 400°F (200°C) 15-20 хвилин до золотистої скоринки.\n" +
                        "Дайте їм охолонути і подавайте як чудову закуску або перекус.\n" +
                        "Насолоджуйтесь домашніми гриссіні!",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 104,
            categoryOfFood = "Хліб",
            dishTitle = "Тараллі",
            imageResId = R.drawable.taralli_70,
            description =
            "Тараллі - традиційні італійські крекери родом з регіону Апулія. Вони універсальні та підходять для різних дієтичних обмежень. Ці хрусткі закуски зазвичай смакують з вином або як закуски. Хоча кількість калорій варіюється, вони приблизно містять 40-60 калорій на порцію. За цим рецептом виходить приблизно 4050 тараллі.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "2 склянки борошна грубого помелу\n" +
                        "1/2 склянки білого вина (сухого)\n" +
                        "1/2 склянки оливкової олії першого віджиму\n" +
                        "1 чайна ложка солі\n" +
                        "За бажанням: насіння фенхелю, чорний перець або інші приправи",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Розігрійте духовку до 375°F (190°C).\n" +
                        "У мисці змішайте борошно, сіль та інші приправи за бажанням.\n" +
                        "Додайте біле вино та оливкову олію і перемішайте до утворення тіста.\n" +
                        "Вимісити тісто до однорідності.\n" +
                        "Розділіть тісто на невеликі шматочки і розкачайте кожен в мотузку, приблизно 5 дюймів завдовжки.\n" +
                        "Сформуйте кожну мотузку у вигляді кільця, притиснувши кінці разом, щоб запечатати.\n" +
                        "Викласти тараллі на деко.\n" +
                        "Випікайте приблизно 25-30 хвилин або поки вони не стануть золотистими.\n" +
                        "Дайте їм охолонути і насолоджуйтеся домашніми тараллі!\n" +
                        "Ці тараллі стануть чудовим хрустким доповненням до ваших італійських закусок чи снеків.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 105,
            categoryOfFood = "Коктейль",
            dishTitle = "Лимончелло Спритц",
            imageResId = R.drawable.limoncello_spritz_94,
            description =
            "Лимончелло Спритц - це чудовий та освіжаючий італійський коктейль, який передає суть Амальфітанського узбережжя. Цей підбадьорливий напій готується шляхом поєднання лікеру Лімончелло, відомого своїм яскравим лимонним смаком, з газованою водою та іноді з додаванням просекко. Зазвичай його подають з льодом і прикрашають скибочками лимона та свіжим листям м'яти для додаткового аромату та естетичного вигляду.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "Лимонний лікер 20 мл.\n" +
                        "Просекко 150 мл.\n" +
                        "Газована мінеральна вода 50 мл.\n" +
                        "Часточки лимонів 2 шт.\n" +
                        "Гілочка розмарину 1 шт.\n" +
                        "Лід 3-4 кубики.",
            ),
            instructions = listOf(
                "Процес приготування:\n" +
                        "1. Покласти кубики льоду в склянку. Додайте лимонний лікер, воду та просекко і злегка перемішайте.\n" +
                        "2. Прикрасити часточками лимона та розмарину.",
            )
        ),

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        RecipeModel(
            id = 106,
            categoryOfFood = "Коктейль",
            dishTitle = "Коктейль Пурпурний",
            imageResId = R.drawable.coctail_purple_106_small,
            description =
            "Коктейль Пурпурний - це освіжаючий напій з яскравою червоною барвою, що поєднує в собі солодкість буряка та гостринку нотку імбиру. Завдяки мигдалевому напою, цей коктейль набуває ніжної текстури та кремовості. Ідеальний вибір для тих, хто шукає щось освіжаюче та нестандартне.",
            ingredients = listOf(
                "Інгредієнти:\n" ,
                        "3 столові ложки імбирного сиропу\n" +
                        "4 склянки мигдалевого напою\n" +
                        "1 склянка бурякового соку",
            ),
            instructions = listOf(
                "Процес приготування:\n" ,
                        "Енергійно змішайте три інгредієнти. Прикрасити мусом з мигдалевого напою та свіжою м'ятою",
            )
        ),


        )
}
